[{"text":"\n\n\n\n\nA BOY'S WILL\n\nBy Robert Frost\n\n\nCONTENTS\n\n    Part I\n        Into My Own\n            The youth is persuaded that he will be rather more than less himself\n            for having forsworn the world.\n        Ghost House\n            He is happy in society of his choosing.\n        My November Guest\n            He is in love with being misunderstood.\n        Love and a Question\n            He is in doubt whether to admit real trouble to a place beside the\n            hearth with love.\n        A Late Walk\n            He courts the autumnal mood.\n        Stars\n            There is no oversight of human affairs.\n        Storm Fear\n            He is afraid of his own isolation.\n        Wind and Window Flower\n            Out of the winter things he fashions a story of modern love.\n        To the Thawing Wind (audio)\n            He calls on change through the violence of the elements.\n        A Prayer in Spring\n            He discovers that the greatness of love lies not in forward-looking\n            thoughts;\n        Flower-gathering\n            nor yet in any spur it may be to ambition.\n        Rose Pogonias\n            He is no dissenter from the ritualism of nature;\n        Asking for Roses\n            nor from the ritualism of youth which is make-believe.\n        Waiting--Afield at Dusk\n            He arrives at the turn of the year.\n        In a Vale\n            Out of old longings he fashions a story.\n        A Dream Pang\n            He is shown by a dream how really well it is with him.\n        In Neglect\n            He is scornful of folk his scorn cannot reach.\n        The Vantage Point\n            And again scornful, but there is no one hurt.\n        Mowing\n            He takes up life simply with the small tasks.\n        Going for Water\n\n    Part II\n        Revelation\n            He resolves to become intelligible, at least to himself, since there\n            is no help else;\n        The Trial by Existence\n            and to know definitely what he thinks about the soul;\n        In Equal Sacrifice\n            about love;\n        The Tuft of Flowers\n            about fellowship;\n        Spoils of the Dead\n            about death;\n        Pan with Us\n            about art (his own);\n        The Demiurge's Laugh\n            about science.\n\n    Part III\n        Now Close the Windows\n            It is time to make an end of speaking.\n        A Line-storm Song\n            It is the autumnal mood with a difference.\n        October\n            He sees days slipping from him that were the best for what they\n            were.\n        My Butterfly\n            There are things that can never be the same.\n        Reluctance\n\n\n\n\nInto My Own\n\n    ONE of my wishes is that those dark trees,\n    So old and firm they scarcely show the breeze,\n    Were not, as 'twere, the merest mask of gloom,\n    But stretched away unto the edge of doom.\n    I should not be withheld but that some day\n    Into their vastness I should steal away,\n    Fearless of ever finding open land,\n    Or highway where the slow wheel pours the sand.\n    I do not see why I should e'er turn back,\n    Or those should not set forth upon my track\n    To overtake me, who should miss me here\n    And long to know if still I held them dear.\n    They would not find me changed from him they knew--\n    Only more sure of all I thought was true.\n\n\n\n\nGhost House\n\n    I DWELL in a lonely house I know\n    That vanished many a summer ago,\n    And left no trace but the cellar walls,\n    And a cellar in which the daylight falls,\n    And the purple-stemmed wild raspberries grow.\n    O'er ruined fences the grape-vines shield\n    The woods come back to the mowing field;\n    The orchard tree has grown one copse\n    Of new wood and old where the woodpecker chops;\n    The footpath down to the well is healed.\n    I dwell with a strangely aching heart\n    In that vanished abode there far apart\n    On that disused and forgotten road\n    That has no dust-bath now for the toad.\n    Night comes; the black bats tumble and dart;\n    The whippoorwill is coming to shout\n    And hush and cluck and flutter about:\n    I hear him begin far enough away\n    Full many a time to say his say\n    Before he arrives to say it out.\n    It is under the small, dim, summer star.\n    I know not who these mute folk are\n    Who share the unlit place with me--\n    Those stones out under the low-limbed tree\n    Doubtless bear names that the mosses mar.\n    They are tireless folk, but slow and sad,\n    Though two, close-keeping, are lass and lad,--\n    With none among them that ever sings,\n    And yet, in view of how many things,\n    As sweet companions as might be had.\n\n\n\n\nMy November Guest\n\n    MY Sorrow, when she's here with me,\n    Thinks these dark days of autumn rain\n    Are beautiful as days can be;\n    She loves the bare, the withered tree;\n    She walks the sodden pasture lane.\n    Her pleasure will not let me stay.\n    She talks and I am fain to list:\n    She's glad the birds are gone away,\n    She's glad her simple worsted gray\n    Is silver now with clinging mist.\n    The desolate, deserted trees,\n    The faded earth, the heavy sky,\n    The beauties she so truly sees,\n    She thinks I have no eye for these,\n    And vexes me for reason why.\n    Not yesterday I learned to know\n    The love of bare November days\n    Before the coming of the snow,\n    But it were vain to tell her so,\n    And they are better for her praise.\n\n\n\n\nLove and a Question\n\n    A STRANGER came to the door at eve,\n    And he spoke the bridegroom fair.\n    He bore a green-white stick in his hand,\n    And, for all burden, care.\n    He asked with the eyes more than the lips\n    For a shelter for the night,\n    And he turned and looked at the road afar\n    Without a window light.\n    The bridegroom came forth into the porch\n    With, 'Let us look at the sky,\n    And question what of the night to be,\n    Stranger, you and I.'\n    The woodbine leaves littered the yard,\n    The woodbine berries were blue,\n    Autumn, yes, winter was in the wind;\n    'Stranger, I wish I knew.'\n    Within, the bride in the dusk alone\n    Bent over the open fire,\n    Her face rose-red with the glowing coal\n    And the thought of the heart's desire.\n    The bridegroom looked at the weary road,\n    Yet saw but her within,\n    And wished her heart in a case of gold\n    And pinned with a silver pin.\n    The bridegroom thought it little to give\n    A dole of bread, a purse,\n    A heartfelt prayer for the poor of God,\n    Or for the rich a curse;\n    But whether or not a man was asked\n    To mar the love of two\n    By harboring woe in the bridal house,\n    The bridegroom wished he knew.\n\n\n\n\nA Late Walk\n\n    WHEN I go up through the mowing field,\n    The headless aftermath,\n    Smooth-laid like thatch with the heavy dew,\n    Half closes the garden path.\n    And when I come to the garden ground,\n    The whir of sober birds\n    Up from the tangle of withered weeds\n    Is sadder than any words.\n    A tree beside the wall stands bare,\n    But a leaf that lingered brown,\n    Disturbed, I doubt not, by my thought,\n    Comes softly rattling down.\n    I end not far from my going forth\n    By picking the faded blue\n    Of the last remaining aster flower\n    To carry again to you.\n\n\n\n\nStars\n\n    HOW countlessly they congregate\n    O'er our tumultuous snow,\n    Which flows in shapes as tall as trees\n    When wintry winds do blow!--\n    As if with keenness for our fate,\n    Our faltering few steps on\n    To white rest, and a place of rest\n    Invisible at dawn,--\n    And yet with neither love nor hate,\n    Those stars like some snow-white\n    Minerva's snow-white marble eyes\n    Without the gift of sight.\n\n\n\n\nStorm Fear\n\n    WHEN the wind works against us in the dark,\n    And pelts with snow\n    The lowest chamber window on the east,\n    And whispers with a sort of stifled bark,\n    The beast,\n    'Come out! Come out!'--\n    It costs no inward struggle not to go,\n    Ah, no!\n    I count our strength,\n    Two and a child,\n    Those of us not asleep subdued to mark\n    How the cold creeps as the fire dies at length,--\n    How drifts are piled,\n    Dooryard and road ungraded,\n    Till even the comforting barn grows far away\n    And my heart owns a doubt\n    Whether 'tis in us to arise with day\n    And save ourselves unaided.\n\n\n\n\nWind and Window Flower\n\n    LOVERS, forget your love,\n    And list to the love of these,\n    She a window flower,\n    And he a winter breeze.\n    When the frosty window veil\n    Was melted down at noon,\n    And the caged yellow bird\n    Hung over her in tune,\n    He marked her through the pane,\n    He could not help but mark,\n    And only passed her by,\n    To come again at dark.\n    He was a winter wind,\n    Concerned with ice and snow,\n    Dead weeds and unmated birds,\n    And little of love could know.\n    But he sighed upon the sill,\n    He gave the sash a shake,\n    As witness all within\n    Who lay that night awake.\n    Perchance he half prevailed\n    To win her for the flight\n    From the firelit looking-glass\n    And warm stove-window light.\n    But the flower leaned aside\n    And thought of naught to say,\n    And morning found the breeze\n    A hundred miles away.\n\n\n\n\nTo the Thawing Wind (audio)\n\n    COME with rain, O loud Southwester!\n    Bring the singer, bring the nester;\n    Give the buried flower a dream;\n    Make the settled snow-bank steam;\n    Find the brown beneath the white;\n    But whate'er you do to-night,\n    Bathe my window, make it flow,\n    Melt it as the ices go;\n    Melt the glass and leave the sticks\n    Like a hermit's crucifix;\n    Burst into my narrow stall;\n    Swing the picture on the wall;\n    Run the rattling pages o'er;\n    Scatter poems on the floor;\n    Turn the poet out of door.\n\n\n\n\nA Prayer in Spring\n\n    OH, give us pleasure in the flowers to-day;\n    And give us not to think so far away\n    As the uncertain harvest; keep us here\n    All simply in the springing of the year.\n    Oh, give us pleasure in the orchard white,\n    Like nothing else by day, like ghosts by night;\n    And make us happy in the happy bees,\n    The swarm dilating round the perfect trees.\n    And make us happy in the darting bird\n    That suddenly above the bees is heard,\n    The meteor that thrusts in with needle bill,\n    And off a blossom in mid air stands still.\n    For this is love and nothing else is love,\n    The which it is reserved for God above\n    To sanctify to what far ends He will,\n    But which it only needs that we fulfil.\n\n\n\n\nFlower-gathering\n\n    I LEFT you in the morning,\n    And in the morning glow,\n    You walked a way beside me\n    To make me sad to go.\n    Do you know me in the gloaming,\n    Gaunt and dusty grey with roaming?\n    Are you dumb because you know me not,\n    Or dumb because you know?\n    All for me? And not a question\n    For the faded flowers gay\n    That could take me from beside you\n    For the ages of a day?\n    They are yours, and be the measure\n    Of their worth for you to treasure,\n    The measure of the little while\n    That I've been long away.\n\n\n\n\nRose Pogonias\n\n    A SATURATED meadow,\n    Sun-shaped and jewel-small,\n    A circle scarcely wider\n    Than the trees around were tall;\n    Where winds were quite excluded,\n    And the air was stifling sweet\n    With the breath of many flowers,--\n    A temple of the heat.\n    There we bowed us in the burning,\n    As the sun's right worship is,\n    To pick where none could miss them\n    A thousand orchises;\n    For though the grass was scattered,\n    Yet every second spear\n    Seemed tipped with wings of color,\n    That tinged the atmosphere.\n    We raised a simple prayer\n    Before we left the spot,\n    That in the general mowing\n    That place might be forgot;\n    Or if not all so favoured,\n    Obtain such grace of hours,\n    That none should mow the grass there\n    While so confused with flowers.\n\n\n\n\nAsking for Roses\n\n    A HOUSE that lacks, seemingly, mistress and master,\n    With doors that none but the wind ever closes,\n    Its floor all littered with glass and with plaster;\n    It stands in a garden of old-fashioned roses.\n    I pass by that way in the gloaming with Mary;\n    'I wonder,' I say, 'who the owner of those is.\n    'Oh, no one you know,' she answers me airy,\n    'But one we must ask if we want any roses.'\n    So we must join hands in the dew coming coldly\n    There in the hush of the wood that reposes,\n    And turn and go up to the open door boldly,\n    And knock to the echoes as beggars for roses.\n    'Pray, are you within there, Mistress Who-were-you?'\n    'Tis Mary that speaks and our errand discloses.\n    'Pray, are you within there? Bestir you, bestir you!\n    'Tis summer again; there's two come for roses.\n    'A word with you, that of the singer recalling--\n    Old Herrick: a saying that every maid knows is\n    A flower unplucked is but left to the falling,\n    And nothing is gained by not gathering roses.'\n    We do not loosen our hands' intertwining\n    (Not caring so very much what she supposes),\n    There when she comes on us mistily shining\n    And grants us by silence the boon of her roses.\n\n\n\n\nWaiting Afield at Dusk\n\n    WHAT things for dream there are when spectre-like,\n    Moving among tall haycocks lightly piled,\n    I enter alone upon the stubble field,\n    From which the laborers' voices late have died,\n    And in the antiphony of afterglow\n    And rising full moon, sit me down\n    Upon the full moon's side of the first haycock\n    And lose myself amid so many alike.\n    I dream upon the opposing lights of the hour,\n    Preventing shadow until the moon prevail;\n    I dream upon the night-hawks peopling heaven,\n    Each circling each with vague unearthly cry,\n    Or plunging headlong with fierce twang afar;\n    And on the bat's mute antics, who would seem\n    Dimly to have made out my secret place,\n    Only to lose it when he pirouettes,\n    And seek it endlessly with purblind haste;\n    On the last swallow's sweep; and on the rasp\n    In the abyss of odor and rustle at my back,\n    That, silenced by my advent, finds once more,\n    After an interval, his instrument,\n    And tries once--twice--and thrice if I be there;\n    And on the worn book of old-golden song\n    I brought not here to read, it seems, but hold\n    And freshen in this air of withering sweetness;\n    But on the memory of one absent most,\n    For whom these lines when they shall greet her eye.\n\n\n\n\nIn a Vale\n\n    WHEN I was young, we dwelt in a vale\n    By a misty fen that rang all night,\n    And thus it was the maidens pale\n    I knew so well, whose garments trail\n    Across the reeds to a window light.\n    The fen had every kind of bloom,\n    And for every kind there was a face,\n    And a voice that has sounded in my room\n    Across the sill from the outer gloom.\n    Each came singly unto her place,\n    But all came every night with the mist;\n    And often they brought so much to say\n    Of things of moment to which, they wist,\n    One so lonely was fain to list,\n    That the stars were almost faded away\n    Before the last went, heavy with dew,\n    Back to the place from which she came--\n    Where the bird was before it flew,\n    Where the flower was before it grew,\n    Where bird and flower were one and the same.\n    And thus it is I know so well\n    Why the flower has odor, the bird has song.\n    You have only to ask me, and I can tell.\n    No, not vainly there did I dwell,\n    Nor vainly listen all the night long.\n\n\n\n\nA Dream Pang\n\n    I HAD withdrawn in forest, and my song\n    Was swallowed up in leaves that blew alway;\n    And to the forest edge you came one day\n    (This was my dream) and looked and pondered long,\n    But did not enter, though the wish was strong:\n    You shook your pensive head as who should say,\n    'I dare not--too far in his footsteps stray--\n    He must seek me would he undo the wrong.\n    Not far, but near, I stood and saw it all\n    Behind low boughs the trees let down outside;\n    And the sweet pang it cost me not to call\n    And tell you that I saw does still abide.\n    But 'tis not true that thus I dwelt aloof,\n    For the wood wakes, and you are here for proof.\n\n\n\n\nIn Neglect\n\n    THEY leave us so to the way we took,\n    As two in whom they were proved mistaken,\n    That we sit sometimes in the wayside nook,\n    With mischievous, vagrant, seraphic look,\n    And try if we cannot feel forsaken.\n\n\n\n\nThe Vantage Point\n\n    IF tired of trees I seek again mankind,\n    Well I know where to hie me--in the dawn,\n    To a slope where the cattle keep the lawn.\n    There amid lolling juniper reclined,\n    Myself unseen, I see in white defined\n    Far off the homes of men, and farther still,\n    The graves of men on an opposing hill,\n    Living or dead, whichever are to mind.\n    And if by moon I have too much of these,\n    I have but to turn on my arm, and lo,\n    The sun-burned hillside sets my face aglow,\n    My breathing shakes the bluet like a breeze,\n    I smell the earth, I smell the bruised plant,\n    I look into the crater of the ant.\n\n\n\n\nMowing\n\n    THERE was never a sound beside the wood but one,\n    And that was my long scythe whispering to the ground.\n    What was it it whispered? I knew not well myself;\n    Perhaps it was something about the heat of the sun,\n    Something, perhaps, about the lack of sound--\n    And that was why it whispered and did not speak.\n    It was no dream of the gift of idle hours,\n    Or easy gold at the hand of fay or elf:\n    Anything more than the truth would have seemed too weak\n    To the earnest love that laid the swale in rows,\n    Not without feeble-pointed spikes of flowers\n    (Pale orchises), and scared a bright green snake.\n    The fact is the sweetest dream that labor knows.\n    My long scythe whispered and left the hay to make.\n\n\n\n\nGoing for Water\n\n    THE well was dry beside the door,\n    And so we went with pail and can\n    Across the fields behind the house\n    To seek the brook if still it ran;\n    Not loth to have excuse to go,\n    Because the autumn eve was fair\n    (Though chill), because the fields were ours,\n    And by the brook our woods were there.\n    We ran as if to meet the moon\n    That slowly dawned behind the trees,\n    The barren boughs without the leaves,\n    Without the birds, without the breeze.\n    But once within the wood, we paused\n    Like gnomes that hid us from the moon,\n    Ready to run to hiding new\n    With laughter when she found us soon.\n    Each laid on other a staying hand\n    To listen ere we dared to look,\n    And in the hush we joined to make\n    We heard, we knew we heard the brook.\n    A note as from a single place,\n    A slender tinkling fall that made\n    Now drops that floated on the pool\n    Like pearls, and now a silver blade.\n\n\n\n\nRevelation\n\n    WE make ourselves a place apart\n    Behind light words that tease and flout,\n    But oh, the agitated heart\n    Till someone find us really out.\n    'Tis pity if the case require\n    (Or so we say) that in the end\n    We speak the literal to inspire\n    The understanding of a friend.\n    But so with all, from babes that play\n    At hide-and-seek to God afar,\n    So all who hide too well away\n    Must speak and tell us where they are.\n\n\n\n\nThe Trial by Existence\n\n    EVEN the bravest that are slain\n    Shall not dissemble their surprise\n    On waking to find valor reign,\n    Even as on earth, in paradise;\n    And where they sought without the sword\n    Wide fields of asphodel fore'er,\n    To find that the utmost reward\n    Of daring should be still to dare.\n    The light of heaven falls whole and white\n    And is not shattered into dyes,\n    The light for ever is morning light;\n    The hills are verdured pasture-wise;\n    The angel hosts with freshness go,\n    And seek with laughter what to brave;--\n    And binding all is the hushed snow\n    Of the far-distant breaking wave.\n    And from a cliff-top is proclaimed\n    The gathering of the souls for birth,\n    The trial by existence named,\n    The obscuration upon earth.\n    And the slant spirits trooping by\n    In streams and cross- and counter-streams\n    Can but give ear to that sweet cry\n    For its suggestion of what dreams!\n    And the more loitering are turned\n    To view once more the sacrifice\n    Of those who for some good discerned\n    Will gladly give up paradise.\n    And a white shimmering concourse rolls\n    Toward the throne to witness there\n    The speeding of devoted souls\n    Which God makes his especial care.\n    And none are taken but who will,\n    Having first heard the life read out\n    That opens earthward, good and ill,\n    Beyond the shadow of a doubt;\n    And very beautifully God limns,\n    And tenderly, life's little dream,\n    But naught extenuates or dims,\n    Setting the thing that is supreme.\n    Nor is there wanting in the press\n    Some spirit to stand simply forth,\n    Heroic in its nakedness,\n    Against the uttermost of earth.\n    The tale of earth's unhonored things\n    Sounds nobler there than 'neath the sun;\n    And the mind whirls and the heart sings,\n    And a shout greets the daring one.\n    But always God speaks at the end:\n    'One thought in agony of strife\n    The bravest would have by for friend,\n    The memory that he chose the life;\n    But the pure fate to which you go\n    Admits no memory of choice,\n    Or the woe were not earthly woe\n    To which you give the assenting voice.'\n    And so the choice must be again,\n    But the last choice is still the same;\n    And the awe passes wonder then,\n    And a hush falls for all acclaim.\n    And God has taken a flower of gold\n    And broken it, and used therefrom\n    The mystic link to bind and hold\n    Spirit to matter till death come.\n    'Tis of the essence of life here,\n    Though we choose greatly, still to lack\n    The lasting memory at all clear,\n    That life has for us on the wrack\n    Nothing but what we somehow chose;\n    Thus are we wholly stripped of pride\n    In the pain that has but one close,\n    Bearing it crushed and mystified.\n\n\n\n\nIn Equal Sacrifice\n\n    THUS of old the Douglas did:\n    He left his land as he was bid\n    With the royal heart of Robert the Bruce\n    In a golden case with a golden lid,\n    To carry the same to the Holy Land;\n    By which we see and understand\n    That that was the place to carry a heart\n    At loyalty and love's command,\n    And that was the case to carry it in.\n    The Douglas had not far to win\n    Before he came to the land of Spain,\n    Where long a holy war had been\n    Against the too-victorious Moor;\n    And there his courage could not endure\n    Not to strike a blow for God\n    Before he made his errand sure.\n    And ever it was intended so,\n    That a man for God should strike a blow,\n    No matter the heart he has in charge\n    For the Holy Land where hearts should go.\n    But when in battle the foe were met,\n    The Douglas found him sore beset,\n    With only strength of the fighting arm\n    For one more battle passage yet--\n    And that as vain to save the day\n    As bring his body safe away--\n    Only a signal deed to do\n    And a last sounding word to say.\n    The heart he wore in a golden chain\n    He swung and flung forth into the plain,\n    And followed it crying 'Heart or death!'\n    And fighting over it perished fain.\n    So may another do of right,\n    Give a heart to the hopeless fight,\n    The more of right the more he loves;\n    So may another redouble might\n    For a few swift gleams of the angry brand,\n    Scorning greatly not to demand\n    In equal sacrifice with his\n    The heart he bore to the Holy Land.\n\n\n\n\nThe Tuft of Flowers\n\n    I WENT to turn the grass once after one\n    Who mowed it in the dew before the sun.\n    The dew was gone that made his blade so keen\n    Before I came to view the leveled scene.\n    I looked for him behind an isle of trees;\n    I listened for his whetstone on the breeze.\n    But he had gone his way, the grass all mown,\n    And I must be, as he had been,--alone,\n    'As all must be,' I said within my heart,\n    'Whether they work together or apart.'\n    But as I said it, swift there passed me by\n    On noiseless wing a 'wildered butterfly,\n    Seeking with memories grown dim o'er night\n    Some resting flower of yesterday's delight.\n    And once I marked his flight go round and round,\n    As where some flower lay withering on the ground.\n    And then he flew as far as eye could see,\n    And then on tremulous wing came back to me.\n    I thought of questions that have no reply,\n    And would have turned to toss the grass to dry;\n    But he turned first, and led my eye to look\n    At a tall tuft of flowers beside a brook,\n    A leaping tongue of bloom the scythe had spared\n    Beside a reedy brook the scythe had bared.\n    I left my place to know them by their name,\n    Finding them butterfly weed when I came.\n    The mower in the dew had loved them thus,\n    By leaving them to flourish, not for us,\n    Nor yet to draw one thought of ours to him.\n    But from sheer morning gladness at the brim.\n    The butterfly and I had lit upon,\n    Nevertheless, a message from the dawn,\n    That made me hear the wakening birds around,\n    And hear his long scythe whispering to the ground,\n    And feel a spirit kindred to my own;\n    So that henceforth I worked no more alone;\n    But glad with him, I worked as with his aid,\n    And weary, sought at noon with him the shade;\n    And dreaming, as it were, held brotherly speech\n    With one whose thought I had not hoped to reach.\n    'Men work together,' I told him from the heart,\n    'Whether they work together or apart.'\n\n\n\n\nSpoils of the Dead\n\n    TWO fairies it was\n    On a still summer day\n    Came forth in the woods\n    With the flowers to play.\n    The flowers they plucked\n    They cast on the ground\n    For others, and those\n    For still others they found.\n    Flower-guided it was\n    That they came as they ran\n    On something that lay\n    In the shape of a man.\n    The snow must have made\n    The feathery bed\n    When this one fell\n    On the sleep of the dead.\n    But the snow was gone\n    A long time ago,\n    And the body he wore\n    Nigh gone with the snow.\n    The fairies drew near\n    And keenly espied\n    A ring on his hand\n    And a chain at his side.\n    They knelt in the leaves\n    And eerily played\n    With the glittering things,\n    And were not afraid.\n    And when they went home\n    To hide in their burrow,\n    They took them along\n    To play with to-morrow.\n    When you came on death,\n    Did you not come flower-guided\n    Like the elves in the wood?\n    I remember that I did.\n    But I recognised death\n    With sorrow and dread,\n    And I hated and hate\n    The spoils of the dead.\n\n\n\n\nPan with Us\n\n    PAN came out of the woods one day,--\n    His skin and his hair and his eyes were gray,\n    The gray of the moss of walls were they,--\n    And stood in the sun and looked his fill\n    At wooded valley and wooded hill.\n    He stood in the zephyr, pipes in hand,\n    On a height of naked pasture land;\n    In all the country he did command\n    He saw no smoke and he saw no roof.\n    That was well! and he stamped a hoof.\n    His heart knew peace, for none came here\n    To this lean feeding save once a year\n    Someone to salt the half-wild steer,\n    Or homespun children with clicking pails\n    Who see no little they tell no tales.\n    He tossed his pipes, too hard to teach\n    A new-world song, far out of reach,\n    For a sylvan sign that the blue jay's screech\n    And the whimper of hawks beside the sun\n    Were music enough for him, for one.\n    Times were changed from what they were:\n    Such pipes kept less of power to stir\n    The fruited bough of the juniper\n    And the fragile bluets clustered there\n    Than the merest aimless breath of air.\n    They were pipes of pagan mirth,\n    And the world had found new terms of worth.\n    He laid him down on the sun-burned earth\n    And ravelled a flower and looked away--\n    Play? Play?--What should he play?\n\n\n\n\nThe Demiurge's Laugh\n\n    IT was far in the sameness of the wood;\n    I was running with joy on the Demon's trail,\n    Though I knew what I hunted was no true god.\n    It was just as the light was beginning to fail\n    That I suddenly heard--all I needed to hear:\n    It has lasted me many and many a year.\n    The sound was behind me instead of before,\n    A sleepy sound, but mocking half,\n    As of one who utterly couldn't care.\n    The Demon arose from his wallow to laugh,\n    Brushing the dirt from his eye as he went;\n    And well I knew what the Demon meant.\n    I shall not forget how his laugh rang out.\n    I felt as a fool to have been so caught,\n    And checked my steps to make pretence\n    It was something among the leaves I sought\n    (Though doubtful whether he stayed to see).\n    Thereafter I sat me against a tree.\n\n\n\n\nNow Close the Windows\n\n    NOW close the windows and hush all the fields;\n    If the trees must, let them silently toss;\n    No bird is singing now, and if there is,\n    Be it my loss.\n    It will be long ere the marshes resume,\n    It will be long ere the earliest bird:\n    So close the windows and not hear the wind,\n    But see all wind-stirred.\n\n\n\n\n\nA Line-storm Song\n\n    THE line-storm clouds fly tattered and swift,\n    The road is forlorn all day,\n    Where a myriad snowy quartz stones lift,\n    And the hoof-prints vanish away.\n    The roadside flowers, too wet for the bee,\n    Expend their bloom in vain.\n    Come over the hills and far with me,\n    And be my love in the rain.\n    The birds have less to say for themselves\n    In the wood-world's torn despair\n    Than now these numberless years the elves,\n    Although they are no less there:\n    All song of the woods is crushed like some\n    Wild, easily shattered rose.\n    Come, be my love in the wet woods; come,\n    Where the boughs rain when it blows.\n    There is the gale to urge behind\n    And bruit our singing down,\n    And the shallow waters aflutter with wind\n    From which to gather your gown.\n    What matter if we go clear to the west,\n    And come not through dry-shod?\n    For wilding brooch shall wet your breast\n    The rain-fresh goldenrod.\n    Oh, never this whelming east wind swells\n    But it seems like the sea's return\n    To the ancient lands where it left the shells\n    Before the age of the fern;\n    And it seems like the time when after doubt\n    Our love came back amain.\n    Oh, come forth into the storm and rout\n    And be my love in the rain.\n\n\n\n\nOctober\n\n    O HUSHED October morning mild,\n    Thy leaves have ripened to the fall;\n    To-morrow's wind, if it be wild,\n    Should waste them all.\n    The crows above the forest call;\n    To-morrow they may form and go.\n    O hushed October morning mild,\n    Begin the hours of this day slow,\n    Make the day seem to us less brief.\n    Hearts not averse to being beguiled,\n    Beguile us in the way you know;\n    Release one leaf at break of day;\n    At noon release another leaf;\n    One from our trees, one far away;\n    Retard the sun with gentle mist;\n    Enchant the land with amethyst.\n    Slow, slow!\n    For the grapes' sake, if they were all,\n    Whose leaves already are burnt with frost,\n    Whose clustered fruit must else be lost--\n    For the grapes' sake along the wall.\n\n\n\n\nMy Butterfly\n\n    THINE emulous fond flowers are dead, too,\n    And the daft sun-assaulter, he\n    That frighted thee so oft, is fled or dead:\n    Save only me\n    (Nor is it sad to thee!)\n    Save only me\n    There is none left to mourn thee in the fields.\n    The gray grass is not dappled with the snow;\n    Its two banks have not shut upon the river;\n    But it is long ago--\n    It seems forever--\n    Since first I saw thee glance,\n    With all the dazzling other ones,\n    In airy dalliance,\n    Precipitate in love,\n    Tossed, tangled, whirled and whirled above,\n    Like a limp rose-wreath in a fairy dance.\n    When that was, the soft mist\n    Of my regret hung not on all the land,\n    And I was glad for thee,\n    And glad for me, I wist.\n    Thou didst not know, who tottered, wandering on high,\n    That fate had made thee for the pleasure of the wind,\n    With those great careless wings,\n    Nor yet did I.\n    And there were other things:\n    It seemed God let thee flutter from his gentle clasp:\n    Then fearful he had let thee win\n    Too far beyond him to be gathered in,\n    Snatched thee, o'er eager, with ungentle grasp.\n    Ah! I remember me\n    How once conspiracy was rife\n    Against my life--\n    The languor of it and the dreaming fond;\n    Surging, the grasses dizzied me of thought,\n    The breeze three odors brought,\n    And a gem-flower waved in a wand!\n    Then when I was distraught\n    And could not speak,\n    Sidelong, full on my cheek,\n    What should that reckless zephyr fling\n    But the wild touch of thy dye-dusty wing!\n    I found that wing broken to-day!\n    For thou are dead, I said,\n    And the strange birds say.\n    I found it with the withered leaves\n    Under the eaves.\n\n\n\n\nReluctance\n\n   OUT through the fields and the woods\n    And over the walls I have wended;\n    I have climbed the hills of view\n    And looked at the world, and descended;\n    I have come by the highway home,\n    And lo, it is ended.\n    The leaves are all dead on the ground,\n    Save those that the oak is keeping\n    To ravel them one by one\n    And let them go scraping and creeping\n    Out over the crusted snow,\n    When others are sleeping.\n    And the dead leaves lie huddled and still,\n    No longer blown hither and thither;\n    The last lone aster is gone;\n    The flowers of the witch-hazel wither;\n    The heart is still aching to seek,\n    But the feet question 'Whither?'\n    Ah, when to the heart of man\n    Was it ever less than a treason\n    To go with the drift of things,\n    To yield with a grace to reason,\n    And bow and accept and accept the end\n    Of a love or a season?\n\n\n\n\n","id":"3021"},{"text":"\n\n\n\n\nNORTH OF BOSTON\n\nBy Robert Frost\n\n\n\n\n          TO\n          E. M. F.\n          THIS BOOK OF PEOPLE\n\n\n\n\nTHE PASTURE\n\n        I'M going out to clean the pasture spring;\n        I'll only stop to rake the leaves away\n        (And wait to watch the water clear, I may):\n        I sha'n't be gone long.--You come too.\n        I'm going out to fetch the little calf\n        That's standing by the mother. It's so young,\n        It totters when she licks it with her tongue.\n        I sha'n't be gone long.--You come too.\n\n\nCONTENTS\n\n         Mending Wall\n         The Death of the Hired Man\n         The Mountain\n         A Hundred Collars\n         Home Burial\n         The Black Cottage\n         Blueberries\n         A Servant to Servants\n         After Apple-picking\n         The Code\n         The Generations of Men\n         The Housekeeper\n         The Fear\n         The Self-seeker\n         The Wood-pile\n         Good Hours\n\n\n\n\nMending Wall\n\n    SOMETHING there is that doesn't love a wall,\n    That sends the frozen-ground-swell under it,\n    And spills the upper boulders in the sun;\n    And makes gaps even two can pass abreast.\n    The work of hunters is another thing:\n    I have come after them and made repair\n    Where they have left not one stone on a stone,\n    But they would have the rabbit out of hiding,\n    To please the yelping dogs. The gaps I mean,\n    No one has seen them made or heard them made,\n    But at spring mending-time we find them there.\n    I let my neighbour know beyond the hill;\n    And on a day we meet to walk the line\n    And set the wall between us once again.\n    We keep the wall between us as we go.\n    To each the boulders that have fallen to each.\n    And some are loaves and some so nearly balls\n    We have to use a spell to make them balance:\n    \"Stay where you are until our backs are turned!\"\n    We wear our fingers rough with handling them.\n    Oh, just another kind of out-door game,\n    One on a side. It comes to little more:\n    There where it is we do not need the wall:\n    He is all pine and I am apple orchard.\n    My apple trees will never get across\n    And eat the cones under his pines, I tell him.\n    He only says, \"Good fences make good neighbours.\"\n    Spring is the mischief in me, and I wonder\n    If I could put a notion in his head:\n    \"Why do they make good neighbours? Isn't it\n    Where there are cows? But here there are no cows.\n    Before I built a wall I'd ask to know\n    What I was walling in or walling out,\n    And to whom I was like to give offence.\n    Something there is that doesn't love a wall,\n    That wants it down.\" I could say \"Elves\" to him,\n    But it's not elves exactly, and I'd rather\n    He said it for himself. I see him there\n    Bringing a stone grasped firmly by the top\n    In each hand, like an old-stone savage armed.\n    He moves in darkness as it seems to me,\n    Not of woods only and the shade of trees.\n    He will not go behind his father's saying,\n    And he likes having thought of it so well\n    He says again, \"Good fences make good neighbours.\"\n\n\n\n\nThe Death of the Hired Man\n\n    MARY sat musing on the lamp-flame at the table\n    Waiting for Warren. When she heard his step,\n    She ran on tip-toe down the darkened passage\n    To meet him in the doorway with the news\n    And put him on his guard. \"Silas is back.\"\n    She pushed him outward with her through the door\n    And shut it after her. \"Be kind,\" she said.\n    She took the market things from Warren's arms\n    And set them on the porch, then drew him down\n    To sit beside her on the wooden steps.\n    \"When was I ever anything but kind to him?\n    But I'll not have the fellow back,\" he said.\n    \"I told him so last haying, didn't I?\n    'If he left then,' I said, 'that ended it.'\n    What good is he? Who else will harbour him\n    At his age for the little he can do?\n    What help he is there's no depending on.\n    Off he goes always when I need him most.\n    'He thinks he ought to earn a little pay,\n    Enough at least to buy tobacco with,\n    So he won't have to beg and be beholden.'\n    'All right,' I say, 'I can't afford to pay\n    Any fixed wages, though I wish I could.'\n    'Someone else can.' 'Then someone else will have to.'\n    I shouldn't mind his bettering himself\n    If that was what it was. You can be certain,\n    When he begins like that, there's someone at him\n    Trying to coax him off with pocket-money,--\n    In haying time, when any help is scarce.\n    In winter he comes back to us. I'm done.\"\n    \"Sh! not so loud: he'll hear you,\" Mary said.\n    \"I want him to: he'll have to soon or late.\"\n    \"He's worn out. He's asleep beside the stove.\n    When I came up from Rowe's I found him here,\n    Huddled against the barn-door fast asleep,\n    A miserable sight, and frightening, too--\n    You needn't smile--I didn't recognise him--\n    I wasn't looking for him--and he's changed.\n    Wait till you see.\"\n    \"Where did you say he'd been?\"\n    \"He didn't say. I dragged him to the house,\n    And gave him tea and tried to make him smoke.\n    I tried to make him talk about his travels.\n    Nothing would do: he just kept nodding off.\"\n    \"What did he say? Did he say anything?\"\n    \"But little.\"\n    \"Anything? Mary, confess\n    He said he'd come to ditch the meadow for me.\"\n    \"Warren!\"\n    \"But did he? I just want to know.\"\n    \"Of course he did. What would you have him say?\n    Surely you wouldn't grudge the poor old man\n    Some humble way to save his self-respect.\n    He added, if you really care to know,\n    He meant to clear the upper pasture, too.\n    That sounds like something you have heard before?\n    Warren, I wish you could have heard the way\n    He jumbled everything. I stopped to look\n    Two or three times--he made me feel so queer--\n    To see if he was talking in his sleep.\n    He ran on Harold Wilson--you remember--\n    The boy you had in haying four years since.\n    He's finished school, and teaching in his college.\n    Silas declares you'll have to get him back.\n    He says they two will make a team for work:\n    Between them they will lay this farm as smooth!\n    The way he mixed that in with other things.\n    He thinks young Wilson a likely lad, though daft\n    On education--you know how they fought\n    All through July under the blazing sun,\n    Silas up on the cart to build the load,\n    Harold along beside to pitch it on.\"\n    \"Yes, I took care to keep well out of earshot.\"\n    \"Well, those days trouble Silas like a dream.\n    You wouldn't think they would. How some things linger!\n    Harold's young college boy's assurance piqued him.\n    After so many years he still keeps finding\n    Good arguments he sees he might have used.\n    I sympathise. I know just how it feels\n    To think of the right thing to say too late.\n    Harold's associated in his mind with Latin.\n    He asked me what I thought of Harold's saying\n    He studied Latin like the violin\n    Because he liked it--that an argument!\n    He said he couldn't make the boy believe\n    He could find water with a hazel prong--\n    Which showed how much good school had ever done him.\n    He wanted to go over that. But most of all\n    He thinks if he could have another chance\n    To teach him how to build a load of hay----\"\n    \"I know, that's Silas' one accomplishment.\n    He bundles every forkful in its place,\n    And tags and numbers it for future reference,\n    So he can find and easily dislodge it\n    In the unloading. Silas does that well.\n    He takes it out in bunches like big birds' nests.\n    You never see him standing on the hay\n    He's trying to lift, straining to lift himself.\"\n    \"He thinks if he could teach him that, he'd be\n    Some good perhaps to someone in the world.\n    He hates to see a boy the fool of books.\n    Poor Silas, so concerned for other folk,\n    And nothing to look backward to with pride,\n    And nothing to look forward to with hope,\n    So now and never any different.\"\n    Part of a moon was falling down the west,\n    Dragging the whole sky with it to the hills.\n    Its light poured softly in her lap. She saw\n    And spread her apron to it. She put out her hand\n    Among the harp-like morning-glory strings,\n    Taut with the dew from garden bed to eaves,\n    As if she played unheard the tenderness\n    That wrought on him beside her in the night.\n    \"Warren,\" she said, \"he has come home to die:\n    You needn't be afraid he'll leave you this time.\"\n    \"Home,\" he mocked gently.\n    \"Yes, what else but home?\n    It all depends on what you mean by home.\n    Of course he's nothing to us, any more\n    Than was the hound that came a stranger to us\n    Out of the woods, worn out upon the trail.\"\n    \"Home is the place where, when you have to go there,\n    They have to take you in.\"\n    \"I should have called it\n    Something you somehow haven't to deserve.\"\n    Warren leaned out and took a step or two,\n    Picked up a little stick, and brought it back\n    And broke it in his hand and tossed it by.\n    \"Silas has better claim on us you think\n    Than on his brother? Thirteen little miles\n    As the road winds would bring him to his door.\n    Silas has walked that far no doubt to-day.\n    Why didn't he go there? His brother's rich,\n    A somebody--director in the bank.\"\n    \"He never told us that.\"\n    \"We know it though.\"\n    \"I think his brother ought to help, of course.\n    I'll see to that if there is need. He ought of right\n    To take him in, and might be willing to--\n    He may be better than appearances.\n    But have some pity on Silas. Do you think\n    If he'd had any pride in claiming kin\n    Or anything he looked for from his brother,\n    He'd keep so still about him all this time?\"\n    \"I wonder what's between them.\"\n    \"I can tell you.\n    Silas is what he is--we wouldn't mind him--\n    But just the kind that kinsfolk can't abide.\n    He never did a thing so very bad.\n    He don't know why he isn't quite as good\n    As anyone. He won't be made ashamed\n    To please his brother, worthless though he is.\"\n    \"I can't think Si ever hurt anyone.\"\n    \"No, but he hurt my heart the way he lay\n    And rolled his old head on that sharp-edged chair-back.\n    He wouldn't let me put him on the lounge.\n    You must go in and see what you can do.\n    I made the bed up for him there to-night.\n    You'll be surprised at him--how much he's broken.\n    His working days are done; I'm sure of it.\"\n    \"I'd not be in a hurry to say that.\"\n    \"I haven't been. Go, look, see for yourself.\n    But, Warren, please remember how it is:\n    He's come to help you ditch the meadow.\n    He has a plan. You mustn't laugh at him.\n    He may not speak of it, and then he may.\n    I'll sit and see if that small sailing cloud\n    Will hit or miss the moon.\"\n    It hit the moon.\n    Then there were three there, making a dim row,\n    The moon, the little silver cloud, and she.\n    Warren returned--too soon, it seemed to her,\n    Slipped to her side, caught up her hand and waited.\n    \"Warren,\" she questioned.\n    \"Dead,\" was all he answered.\n\n\n\n\nThe Mountain\n\n    THE mountain held the town as in a shadow\n    I saw so much before I slept there once:\n    I noticed that I missed stars in the west,\n    Where its black body cut into the sky.\n    Near me it seemed: I felt it like a wall\n    Behind which I was sheltered from a wind.\n    And yet between the town and it I found,\n    When I walked forth at dawn to see new things,\n    Were fields, a river, and beyond, more fields.\n    The river at the time was fallen away,\n    And made a widespread brawl on cobble-stones;\n    But the signs showed what it had done in spring;\n    Good grass-land gullied out, and in the grass\n    Ridges of sand, and driftwood stripped of bark.\n    I crossed the river and swung round the mountain.\n    And there I met a man who moved so slow\n    With white-faced oxen in a heavy cart,\n    It seemed no hand to stop him altogether.\n    \"What town is this?\" I asked.\n    \"This? Lunenburg.\"\n    Then I was wrong: the town of my sojourn,\n    Beyond the bridge, was not that of the mountain,\n    But only felt at night its shadowy presence.\n    \"Where is your village? Very far from here?\"\n    \"There is no village--only scattered farms.\n    We were but sixty voters last election.\n    We can't in nature grow to many more:\n    That thing takes all the room!\" He moved his goad.\n    The mountain stood there to be pointed at.\n    Pasture ran up the side a little way,\n    And then there was a wall of trees with trunks:\n    After that only tops of trees, and cliffs\n    Imperfectly concealed among the leaves.\n    A dry ravine emerged from under boughs\n    Into the pasture.\n    \"That looks like a path.\n    Is that the way to reach the top from here?--\n    Not for this morning, but some other time:\n    I must be getting back to breakfast now.\"\n    \"I don't advise your trying from this side.\n    There is no proper path, but those that have\n    Been up, I understand, have climbed from Ladd's.\n    That's five miles back. You can't mistake the place:\n    They logged it there last winter some way up.\n    I'd take you, but I'm bound the other way.\"\n    \"You've never climbed it?\"\n    \"I've been on the sides\n    Deer-hunting and trout-fishing. There's a brook\n    That starts up on it somewhere--I've heard say\n    Right on the top, tip-top--a curious thing.\n    But what would interest you about the brook,\n    It's always cold in summer, warm in winter.\n    One of the great sights going is to see\n    It steam in winter like an ox's breath,\n    Until the bushes all along its banks\n    Are inch-deep with the frosty spines and bristles--\n    You know the kind. Then let the sun shine on it!\"\n    \"There ought to be a view around the world\n    From such a mountain--if it isn't wooded\n    Clear to the top.\" I saw through leafy screens\n    Great granite terraces in sun and shadow,\n    Shelves one could rest a knee on getting up--\n    With depths behind him sheer a hundred feet;\n    Or turn and sit on and look out and down,\n    With little ferns in crevices at his elbow.\n    \"As to that I can't say. But there's the spring,\n    Right on the summit, almost like a fountain.\n    That ought to be worth seeing.\"\n    \"If it's there.\n    You never saw it?\"\n    \"I guess there's no doubt\n    About its being there. I never saw it.\n    It may not be right on the very top:\n    It wouldn't have to be a long way down\n    To have some head of water from above,\n    And a good distance down might not be noticed\n    By anyone who'd come a long way up.\n    One time I asked a fellow climbing it\n    To look and tell me later how it was.\"\n    \"What did he say?\"\n    \"He said there was a lake\n    Somewhere in Ireland on a mountain top.\"\n    \"But a lake's different. What about the spring?\"\n    \"He never got up high enough to see.\n    That's why I don't advise your trying this side.\n    He tried this side. I've always meant to go\n    And look myself, but you know how it is:\n    It doesn't seem so much to climb a mountain\n    You've worked around the foot of all your life.\n    What would I do? Go in my overalls,\n    With a big stick, the same as when the cows\n    Haven't come down to the bars at milking time?\n    Or with a shotgun for a stray black bear?\n    'Twouldn't seem real to climb for climbing it.\"\n    \"I shouldn't climb it if I didn't want to--\n    Not for the sake of climbing. What's its name?\"\n    \"We call it Hor: I don't know if that's right.\"\n    \"Can one walk around it? Would it be too far?\"\n    \"You can drive round and keep in Lunenburg,\n    But it's as much as ever you can do,\n    The boundary lines keep in so close to it.\n    Hor is the township, and the township's Hor--\n    And a few houses sprinkled round the foot,\n    Like boulders broken off the upper cliff,\n    Rolled out a little farther than the rest.\"\n    \"Warm in December, cold in June, you say?\"\n    \"I don't suppose the water's changed at all.\n    You and I know enough to know it's warm\n    Compared with cold, and cold compared with warm.\n    But all the fun's in how you say a thing.\"\n    \"You've lived here all your life?\"\n    \"Ever since Hor\n    Was no bigger than a----\" What, I did not hear.\n    He drew the oxen toward him with light touches\n    Of his slim goad on nose and offside flank,\n    Gave them their marching orders and was moving.\n\n\n\n\nA Hundred Collars\n\n    LANCASTER bore him--such a little town,\n    Such a great man. It doesn't see him often\n    Of late years, though he keeps the old homestead\n    And sends the children down there with their mother\n    To run wild in the summer--a little wild.\n    Sometimes he joins them for a day or two\n    And sees old friends he somehow can't get near.\n    They meet him in the general store at night,\n    Pre-occupied with formidable mail,\n    Rifling a printed letter as he talks.\n    They seem afraid. He wouldn't have it so:\n    Though a great scholar, he's a democrat,\n    If not at heart, at least on principle.\n    Lately when coming up to Lancaster\n    His train being late he missed another train\n    And had four hours to wait at Woodsville Junction\n    After eleven o'clock at night. Too tired\n    To think of sitting such an ordeal out,\n    He turned to the hotel to find a bed.\n    \"No room,\" the night clerk said. \"Unless----\"\n    Woodsville's a place of shrieks and wandering lamps\n    And cars that shook and rattle--and one hotel.\n    \"You say 'unless.'\"\n    \"Unless you wouldn't mind\n    Sharing a room with someone else.\"\n    \"Who is it?\"\n    \"A man.\"\n    \"So I should hope. What kind of man?\"\n    \"I know him: he's all right. A man's a man.\n    Separate beds of course you understand.\"\n    The night clerk blinked his eyes and dared him on.\n    \"Who's that man sleeping in the office chair?\n    Has he had the refusal of my chance?\"\n    \"He was afraid of being robbed or murdered.\n    What do you say?\"\n    \"I'll have to have a bed.\"\n    The night clerk led him up three flights of stairs\n    And down a narrow passage full of doors,\n    At the last one of which he knocked and entered.\n    \"Lafe, here's a fellow wants to share your room.\"\n    \"Show him this way. I'm not afraid of him.\n    I'm not so drunk I can't take care of myself.\"\n    The night clerk clapped a bedstead on the foot.\n    \"This will be yours. Good-night,\" he said, and went.\n    \"Lafe was the name, I think?\"\n    \"Yes, Layfayette.\n    You got it the first time. And yours?\"\n    \"Magoon.\n    Doctor Magoon.\"\n    \"A Doctor?\"\n    \"Well, a teacher.\"\n    \"Professor Square-the-circle-till-you're-tired?\n    Hold on, there's something I don't think of now\n    That I had on my mind to ask the first\n    Man that knew anything I happened in with.\n    I'll ask you later--don't let me forget it.\"\n    The Doctor looked at Lafe and looked away.\n    A man? A brute. Naked above the waist,\n    He sat there creased and shining in the light,\n    Fumbling the buttons in a well-starched shirt.\n    \"I'm moving into a size-larger shirt.\n    I've felt mean lately; mean's no name for it.\n    I just found what the matter was to-night:\n    I've been a-choking like a nursery tree\n    When it outgrows the wire band of its name tag.\n    I blamed it on the hot spell we've been having.\n    'Twas nothing but my foolish hanging back,\n    Not liking to own up I'd grown a size.\n    Number eighteen this is. What size do you wear?\"\n    The Doctor caught his throat convulsively.\n    \"Oh--ah--fourteen--fourteen.\"\n    \"Fourteen! You say so!\n    I can remember when I wore fourteen.\n    And come to think I must have back at home\n    More than a hundred collars, size fourteen.\n    Too bad to waste them all. You ought to have them.\n    They're yours and welcome; let me send them to you.\n    What makes you stand there on one leg like that?\n    You're not much furtherer than where Kike left you.\n    You act as if you wished you hadn't come.\n    Sit down or lie down, friend; you make me nervous.\"\n    The Doctor made a subdued dash for it,\n    And propped himself at bay against a pillow.\n    \"Not that way, with your shoes on Kike's white bed.\n    You can't rest that way. Let me pull your shoes off.\"\n    \"Don't touch me, please--I say, don't touch me, please.\n    I'll not be put to bed by you, my man.\"\n    \"Just as you say. Have it your own way then.\n    'My man' is it? You talk like a professor.\n    Speaking of who's afraid of who, however,\n    I'm thinking I have more to lose than you\n    If anything should happen to be wrong.\n    Who wants to cut your number fourteen throat!\n    Let's have a show down as an evidence\n    Of good faith. There is ninety dollars.\n    Come, if you're not afraid.\"\n    \"I'm not afraid.\n    There's five: that's all I carry.\"\n    \"I can search you?\n    Where are you moving over to? Stay still.\n    You'd better tuck your money under you\n    And sleep on it the way I always do\n    When I'm with people I don't trust at night.\"\n    \"Will you believe me if I put it there\n    Right on the counterpane--that I do trust you?\"\n    \"You'd say so, Mister Man.--I'm a collector.\n    My ninety isn't mine--you won't think that.\n    I pick it up a dollar at a time\n    All round the country for the Weekly News,\n    Published in Bow. You know the Weekly News?\"\n    \"Known it since I was young.\"\n    \"Then you know me.\n    Now we are getting on together--talking.\n    I'm sort of Something for it at the front.\n    My business is to find what people want:\n    They pay for it, and so they ought to have it.\n    Fairbanks, he says to me--he's editor--\n    Feel out the public sentiment--he says.\n    A good deal comes on me when all is said.\n    The only trouble is we disagree\n    In politics: I'm Vermont Democrat--\n    You know what that is, sort of double-dyed;\n    The News has always been Republican.\n    Fairbanks, he says to me, 'Help us this year,'\n    Meaning by us their ticket. 'No,' I says,\n    'I can't and won't. You've been in long enough:\n    It's time you turned around and boosted us.\n    You'll have to pay me more than ten a week\n    If I'm expected to elect Bill Taft.\n    I doubt if I could do it anyway.'\"\n    \"You seem to shape the paper's policy.\"\n    \"You see I'm in with everybody, know 'em all.\n    I almost know their farms as well as they do.\"\n    \"You drive around? It must be pleasant work.\"\n    \"It's business, but I can't say it's not fun.\n    What I like best's the lay of different farms,\n    Coming out on them from a stretch of woods,\n    Or over a hill or round a sudden corner.\n    I like to find folks getting out in spring,\n    Raking the dooryard, working near the house.\n    Later they get out further in the fields.\n    Everything's shut sometimes except the barn;\n    The family's all away in some back meadow.\n    There's a hay load a-coming--when it comes.\n    And later still they all get driven in:\n    The fields are stripped to lawn, the garden patches\n    Stripped to bare ground, the apple trees\n    To whips and poles. There's nobody about.\n    The chimney, though, keeps up a good brisk smoking.\n    And I lie back and ride. I take the reins\n    Only when someone's coming, and the mare\n    Stops when she likes: I tell her when to go.\n    I've spoiled Jemima in more ways than one.\n    She's got so she turns in at every house\n    As if she had some sort of curvature,\n    No matter if I have no errand there.\n    She thinks I'm sociable. I maybe am.\n    It's seldom I get down except for meals, though.\n    Folks entertain me from the kitchen doorstep,\n    All in a family row down to the youngest.\"\n    \"One would suppose they might not be as glad\n    To see you as you are to see them.\"\n    \"Oh,\n    Because I want their dollar. I don't want\n    Anything they've not got. I never dun.\n    I'm there, and they can pay me if they like.\n    I go nowhere on purpose: I happen by.\n    Sorry there is no cup to give you a drink.\n    I drink out of the bottle--not your style.\n    Mayn't I offer you----?\"\n    \"No, no, no, thank you.\"\n    \"Just as you say. Here's looking at you then.--\n    And now I'm leaving you a little while.\n    You'll rest easier when I'm gone, perhaps--\n    Lie down--let yourself go and get some sleep.\n    But first--let's see--what was I going to ask you?\n    Those collars--who shall I address them to,\n    Suppose you aren't awake when I come back?\"\n    \"Really, friend, I can't let you. You--may need them.\"\n    \"Not till I shrink, when they'll be out of style.\"\n    \"But really I--I have so many collars.\"\n    \"I don't know who I rather would have have them.\n    They're only turning yellow where they are.\n    But you're the doctor as the saying is.\n    I'll put the light out. Don't you wait for me:\n    I've just begun the night. You get some sleep.\n    I'll knock so-fashion and peep round the door\n    When I come back so you'll know who it is.\n    There's nothing I'm afraid of like scared people.\n    I don't want you should shoot me in the head.\n    What am I doing carrying off this bottle?\n    There now, you get some sleep.\"\n    He shut the door.\n    The Doctor slid a little down the pillow.\n\n\n\n\nHome Burial\n\n    HE saw her from the bottom of the stairs\n    Before she saw him. She was starting down,\n    Looking back over her shoulder at some fear.\n    She took a doubtful step and then undid it\n    To raise herself and look again. He spoke\n    Advancing toward her: \"What is it you see\n    From up there always--for I want to know.\"\n    She turned and sank upon her skirts at that,\n    And her face changed from terrified to dull.\n    He said to gain time: \"What is it you see,\"\n    Mounting until she cowered under him.\n    \"I will find out now--you must tell me, dear.\"\n    She, in her place, refused him any help\n    With the least stiffening of her neck and silence.\n    She let him look, sure that he wouldn't see,\n    Blind creature; and a while he didn't see.\n    But at last he murmured, \"Oh,\" and again, \"Oh.\"\n    \"What is it--what?\" she said.\n    \"Just that I see.\"\n    \"You don't,\" she challenged. \"Tell me what it is.\"\n    \"The wonder is I didn't see at once.\n    I never noticed it from here before.\n    I must be wonted to it--that's the reason.\n    The little graveyard where my people are!\n    So small the window frames the whole of it.\n    Not so much larger than a bedroom, is it?\n    There are three stones of slate and one of marble,\n    Broad-shouldered little slabs there in the sunlight\n    On the sidehill. We haven't to mind those.\n    But I understand: it is not the stones,\n    But the child's mound----\"\n    \"Don't, don't, don't, don't,\" she cried.\n    She withdrew shrinking from beneath his arm\n    That rested on the banister, and slid downstairs;\n    And turned on him with such a daunting look,\n    He said twice over before he knew himself:\n    \"Can't a man speak of his own child he's lost?\"\n    \"Not you! Oh, where's my hat? Oh, I don't need it!\n    I must get out of here. I must get air.\n    I don't know rightly whether any man can.\"\n    \"Amy! Don't go to someone else this time.\n    Listen to me. I won't come down the stairs.\"\n    He sat and fixed his chin between his fists.\n    \"There's something I should like to ask you, dear.\"\n    \"You don't know how to ask it.\"\n    \"Help me, then.\"\n    Her fingers moved the latch for all reply.\n    \"My words are nearly always an offence.\n    I don't know how to speak of anything\n    So as to please you. But I might be taught\n    I should suppose. I can't say I see how.\n    A man must partly give up being a man\n    With women-folk. We could have some arrangement\n    By which I'd bind myself to keep hands off\n    Anything special you're a-mind to name.\n    Though I don't like such things 'twixt those that love.\n    Two that don't love can't live together without them.\n    But two that do can't live together with them.\"\n    She moved the latch a little. \"Don't--don't go.\n    Don't carry it to someone else this time.\n    Tell me about it if it's something human.\n    Let me into your grief. I'm not so much\n    Unlike other folks as your standing there\n    Apart would make me out. Give me my chance.\n    I do think, though, you overdo it a little.\n    What was it brought you up to think it the thing\n    To take your mother-loss of a first child\n    So inconsolably--in the face of love.\n    You'd think his memory might be satisfied----\"\n    \"There you go sneering now!\"\n    \"I'm not, I'm not!\n    You make me angry. I'll come down to you.\n    God, what a woman! And it's come to this,\n    A man can't speak of his own child that's dead.\"\n    \"You can't because you don't know how.\n    If you had any feelings, you that dug\n    With your own hand--how could you?--his little grave;\n    I saw you from that very window there,\n    Making the gravel leap and leap in air,\n    Leap up, like that, like that, and land so lightly\n    And roll back down the mound beside the hole.\n    I thought, Who is that man? I didn't know you.\n    And I crept down the stairs and up the stairs\n    To look again, and still your spade kept lifting.\n    Then you came in. I heard your rumbling voice\n    Out in the kitchen, and I don't know why,\n    But I went near to see with my own eyes.\n    You could sit there with the stains on your shoes\n    Of the fresh earth from your own baby's grave\n    And talk about your everyday concerns.\n    You had stood the spade up against the wall\n    Outside there in the entry, for I saw it.\"\n    \"I shall laugh the worst laugh I ever laughed.\n    I'm cursed. God, if I don't believe I'm cursed.\"\n    \"I can repeat the very words you were saying.\n    'Three foggy mornings and one rainy day\n    Will rot the best birch fence a man can build.'\n    Think of it, talk like that at such a time!\n    What had how long it takes a birch to rot\n    To do with what was in the darkened parlour.\n    You couldn't care! The nearest friends can go\n    With anyone to death, comes so far short\n    They might as well not try to go at all.\n    No, from the time when one is sick to death,\n    One is alone, and he dies more alone.\n    Friends make pretence of following to the grave,\n    But before one is in it, their minds are turned\n    And making the best of their way back to life\n    And living people, and things they understand.\n    But the world's evil. I won't have grief so\n    If I can change it. Oh, I won't, I won't!\"\n    \"There, you have said it all and you feel better.\n    You won't go now. You're crying. Close the door.\n    The heart's gone out of it: why keep it up.\n    Amy! There's someone coming down the road!\"\n    \"You--oh, you think the talk is all. I must go--\n    Somewhere out of this house. How can I make you----\"\n    \"If--you--do!\" She was opening the door wider.\n    \"Where do you mean to go? First tell me that.\n    I'll follow and bring you back by force. I will!--\"\n\n\n\n\nThe Black Cottage\n\n    WE chanced in passing by that afternoon\n    To catch it in a sort of special picture\n    Among tar-banded ancient cherry trees,\n    Set well back from the road in rank lodged grass,\n    The little cottage we were speaking of,\n    A front with just a door between two windows,\n    Fresh painted by the shower a velvet black.\n    We paused, the minister and I, to look.\n    He made as if to hold it at arm's length\n    Or put the leaves aside that framed it in.\n    \"Pretty,\" he said. \"Come in. No one will care.\"\n    The path was a vague parting in the grass\n    That led us to a weathered window-sill.\n    We pressed our faces to the pane. \"You see,\" he said,\n    \"Everything's as she left it when she died.\n    Her sons won't sell the house or the things in it.\n    They say they mean to come and summer here\n    Where they were boys. They haven't come this year.\n    They live so far away--one is out west--\n    It will be hard for them to keep their word.\n    Anyway they won't have the place disturbed.\"\n    A buttoned hair-cloth lounge spread scrolling arms\n    Under a crayon portrait on the wall\n    Done sadly from an old daguerreotype.\n    \"That was the father as he went to war.\n    She always, when she talked about war,\n    Sooner or later came and leaned, half knelt\n    Against the lounge beside it, though I doubt\n    If such unlifelike lines kept power to stir\n    Anything in her after all the years.\n    He fell at Gettysburg or Fredericksburg,\n    I ought to know--it makes a difference which:\n    Fredericksburg wasn't Gettysburg, of course.\n    But what I'm getting to is how forsaken\n    A little cottage this has always seemed;\n    Since she went more than ever, but before--\n    I don't mean altogether by the lives\n    That had gone out of it, the father first,\n    Then the two sons, till she was left alone.\n    (Nothing could draw her after those two sons.\n    She valued the considerate neglect\n    She had at some cost taught them after years.)\n    I mean by the world's having passed it by--\n    As we almost got by this afternoon.\n    It always seems to me a sort of mark\n    To measure how far fifty years have brought us.\n    Why not sit down if you are in no haste?\n    These doorsteps seldom have a visitor.\n    The warping boards pull out their own old nails\n    With none to tread and put them in their place.\n    She had her own idea of things, the old lady.\n    And she liked talk. She had seen Garrison\n    And Whittier, and had her story of them.\n    One wasn't long in learning that she thought\n    Whatever else the Civil War was for\n    It wasn't just to keep the States together,\n    Nor just to free the slaves, though it did both.\n    She wouldn't have believed those ends enough\n    To have given outright for them all she gave.\n    Her giving somehow touched the principle\n    That all men are created free and equal.\n    And to hear her quaint phrases--so removed\n    From the world's view to-day of all those things.\n    That's a hard mystery of Jefferson's.\n    What did he mean? Of course the easy way\n    Is to decide it simply isn't true.\n    It may not be. I heard a fellow say so.\n    But never mind, the Welshman got it planted\n    Where it will trouble us a thousand years.\n    Each age will have to reconsider it.\n    You couldn't tell her what the West was saying,\n    And what the South to her serene belief.\n    She had some art of hearing and yet not\n    Hearing the latter wisdom of the world.\n    White was the only race she ever knew.\n    Black she had scarcely seen, and yellow never.\n    But how could they be made so very unlike\n    By the same hand working in the same stuff?\n    She had supposed the war decided that.\n    What are you going to do with such a person?\n    Strange how such innocence gets its own way.\n    I shouldn't be surprised if in this world\n    It were the force that would at last prevail.\n    Do you know but for her there was a time\n    When to please younger members of the church,\n    Or rather say non-members in the church,\n    Whom we all have to think of nowadays,\n    I would have changed the Creed a very little?\n    Not that she ever had to ask me not to;\n    It never got so far as that; but the bare thought\n    Of her old tremulous bonnet in the pew,\n    And of her half asleep was too much for me.\n    Why, I might wake her up and startle her.\n    It was the words 'descended into Hades'\n    That seemed too pagan to our liberal youth.\n    You know they suffered from a general onslaught.\n    And well, if they weren't true why keep right on\n    Saying them like the heathen? We could drop them.\n    Only--there was the bonnet in the pew.\n    Such a phrase couldn't have meant much to her.\n    But suppose she had missed it from the Creed\n    As a child misses the unsaid Good-night,\n    And falls asleep with heartache--how should I feel?\n    I'm just as glad she made me keep hands off,\n    For, dear me, why abandon a belief\n    Merely because it ceases to be true.\n    Cling to it long enough, and not a doubt\n    It will turn true again, for so it goes.\n    Most of the change we think we see in life\n    Is due to truths being in and out of favour.\n    As I sit here, and oftentimes, I wish\n    I could be monarch of a desert land\n    I could devote and dedicate forever\n    To the truths we keep coming back and back to.\n    So desert it would have to be, so walled\n    By mountain ranges half in summer snow,\n    No one would covet it or think it worth\n    The pains of conquering to force change on.\n    Scattered oases where men dwelt, but mostly\n    Sand dunes held loosely in tamarisk\n    Blown over and over themselves in idleness.\n    Sand grains should sugar in the natal dew\n    The babe born to the desert, the sand storm\n    Retard mid-waste my cowering caravans--\n    \"There are bees in this wall.\" He struck the clapboards,\n    Fierce heads looked out; small bodies pivoted.\n    We rose to go. Sunset blazed on the windows.\n\n\n\n\nBlueberries\n\n    \"YOU ought to have seen what I saw on my way\n    To the village, through Mortenson's pasture to-day:\n    Blueberries as big as the end of your thumb,\n    Real sky-blue, and heavy, and ready to drum\n    In the cavernous pail of the first one to come!\n    And all ripe together, not some of them green\n    And some of them ripe! You ought to have seen!\"\n    \"I don't know what part of the pasture you mean.\"\n    \"You know where they cut off the woods--let me see--\n    It was two years ago--or no!--can it be\n    No longer than that?--and the following fall\n    The fire ran and burned it all up but the wall.\"\n    \"Why, there hasn't been time for the bushes to grow.\n    That's always the way with the blueberries, though:\n    There may not have been the ghost of a sign\n    Of them anywhere under the shade of the pine,\n    But get the pine out of the way, you may burn\n    The pasture all over until not a fern\n    Or grass-blade is left, not to mention a stick,\n    And presto, they're up all around you as thick\n    And hard to explain as a conjuror's trick.\"\n    \"It must be on charcoal they fatten their fruit.\n    I taste in them sometimes the flavour of soot.\n    And after all really they're ebony skinned:\n    The blue's but a mist from the breath of the wind,\n    A tarnish that goes at a touch of the hand,\n    And less than the tan with which pickers are tanned.\"\n    \"Does Mortenson know what he has, do you think?\"\n    \"He may and not care and so leave the chewink\n    To gather them for him--you know what he is.\n    He won't make the fact that they're rightfully his\n    An excuse for keeping us other folk out.\"\n    \"I wonder you didn't see Loren about.\"\n    \"The best of it was that I did. Do you know,\n    I was just getting through what the field had to show\n    And over the wall and into the road,\n    When who should come by, with a democrat-load\n    Of all the young chattering Lorens alive,\n    But Loren, the fatherly, out for a drive.\"\n    \"He saw you, then? What did he do? Did he frown?\"\n    \"He just kept nodding his head up and down.\n    You know how politely he always goes by.\n    But he thought a big thought--I could tell by his eye--\n    Which being expressed, might be this in effect:\n    'I have left those there berries, I shrewdly suspect,\n    To ripen too long. I am greatly to blame.'\"\n    \"He's a thriftier person than some I could name.\"\n    \"He seems to be thrifty; and hasn't he need,\n    With the mouths of all those young Lorens to feed?\n    He has brought them all up on wild berries, they say,\n    Like birds. They store a great many away.\n    They eat them the year round, and those they don't eat\n    They sell in the store and buy shoes for their feet.\"\n    \"Who cares what they say? It's a nice way to live,\n    Just taking what Nature is willing to give,\n    Not forcing her hand with harrow and plow.\"\n    \"I wish you had seen his perpetual bow--\n    And the air of the youngsters! Not one of them turned,\n    And they looked so solemn-absurdly concerned.\"\n    \"I wish I knew half what the flock of them know\n    Of where all the berries and other things grow,\n    Cranberries in bogs and raspberries on top\n    Of the boulder-strewn mountain, and when they will crop.\n    I met them one day and each had a flower\n    Stuck into his berries as fresh as a shower;\n    Some strange kind--they told me it hadn't a name.\"\n    \"I've told you how once not long after we came,\n    I almost provoked poor Loren to mirth\n    By going to him of all people on earth\n    To ask if he knew any fruit to be had\n    For the picking. The rascal, he said he'd be glad\n    To tell if he knew. But the year had been bad.\n    There had been some berries--but those were all gone.\n    He didn't say where they had been. He went on:\n    'I'm sure--I'm sure'--as polite as could be.\n    He spoke to his wife in the door, 'Let me see,\n    Mame, we don't know any good berrying place?'\n    It was all he could do to keep a straight face.\n    \"If he thinks all the fruit that grows wild is for him,\n    He'll find he's mistaken. See here, for a whim,\n    We'll pick in the Mortensons' pasture this year.\n    We'll go in the morning, that is, if it's clear,\n    And the sun shines out warm: the vines must be wet.\n    It's so long since I picked I almost forget\n    How we used to pick berries: we took one look round,\n    Then sank out of sight like trolls underground,\n    And saw nothing more of each other, or heard,\n    Unless when you said I was keeping a bird\n    Away from its nest, and I said it was you.\n    'Well, one of us is.' For complaining it flew\n    Around and around us. And then for a while\n    We picked, till I feared you had wandered a mile,\n    And I thought I had lost you. I lifted a shout\n    Too loud for the distance you were, it turned out,\n    For when you made answer, your voice was as low\n    As talking--you stood up beside me, you know.\"\n    \"We sha'n't have the place to ourselves to enjoy--\n    Not likely, when all the young Lorens deploy.\n    They'll be there to-morrow, or even to-night.\n    They won't be too friendly--they may be polite--\n    To people they look on as having no right\n    To pick where they're picking. But we won't complain.\n    You ought to have seen how it looked in the rain,\n    The fruit mixed with water in layers of leaves,\n    Like two kinds of jewels, a vision for thieves.\"\n\n\n\n\nA Servant to Servants\n\n    I DIDN'T make you know how glad I was\n    To have you come and camp here on our land.\n    I promised myself to get down some day\n    And see the way you lived, but I don't know!\n    With a houseful of hungry men to feed\n    I guess you'd find.... It seems to me\n    I can't express my feelings any more\n    Than I can raise my voice or want to lift\n    My hand (oh, I can lift it when I have to).\n    Did ever you feel so? I hope you never.\n    It's got so I don't even know for sure\n    Whether I am glad, sorry, or anything.\n    There's nothing but a voice-like left inside\n    That seems to tell me how I ought to feel,\n    And would feel if I wasn't all gone wrong.\n    You take the lake. I look and look at it.\n    I see it's a fair, pretty sheet of water.\n    I stand and make myself repeat out loud\n    The advantages it has, so long and narrow,\n    Like a deep piece of some old running river\n    Cut short off at both ends. It lies five miles\n    Straight away through the mountain notch\n    From the sink window where I wash the plates,\n    And all our storms come up toward the house,\n    Drawing the slow waves whiter and whiter and whiter.\n    It took my mind off doughnuts and soda biscuit\n    To step outdoors and take the water dazzle\n    A sunny morning, or take the rising wind\n    About my face and body and through my wrapper,\n    When a storm threatened from the Dragon's Den,\n    And a cold chill shivered across the lake.\n    I see it's a fair, pretty sheet of water,\n    Our Willoughby! How did you hear of it?\n    I expect, though, everyone's heard of it.\n    In a book about ferns? Listen to that!\n    You let things more like feathers regulate\n    Your going and coming. And you like it here?\n    I can see how you might. But I don't know!\n    It would be different if more people came,\n    For then there would be business. As it is,\n    The cottages Len built, sometimes we rent them,\n    Sometimes we don't. We've a good piece of shore\n    That ought to be worth something, and may yet.\n    But I don't count on it as much as Len.\n    He looks on the bright side of everything,\n    Including me. He thinks I'll be all right\n    With doctoring. But it's not medicine--\n    Lowe is the only doctor's dared to say so--\n    It's rest I want--there, I have said it out--\n    From cooking meals for hungry hired men\n    And washing dishes after them--from doing\n    Things over and over that just won't stay done.\n    By good rights I ought not to have so much\n    Put on me, but there seems no other way.\n    Len says one steady pull more ought to do it.\n    He says the best way out is always through.\n    And I agree to that, or in so far\n    As that I can see no way out but through--\n    Leastways for me--and then they'll be convinced.\n    It's not that Len don't want the best for me.\n    It was his plan our moving over in\n    Beside the lake from where that day I showed you\n    We used to live--ten miles from anywhere.\n    We didn't change without some sacrifice,\n    But Len went at it to make up the loss.\n    His work's a man's, of course, from sun to sun,\n    But he works when he works as hard as I do--\n    Though there's small profit in comparisons.\n    (Women and men will make them all the same.)\n    But work ain't all. Len undertakes too much.\n    He's into everything in town. This year\n    It's highways, and he's got too many men\n    Around him to look after that make waste.\n    They take advantage of him shamefully,\n    And proud, too, of themselves for doing so.\n    We have four here to board, great good-for-nothings,\n    Sprawling about the kitchen with their talk\n    While I fry their bacon. Much they care!\n    No more put out in what they do or say\n    Than if I wasn't in the room at all.\n    Coming and going all the time, they are:\n    I don't learn what their names are, let alone\n    Their characters, or whether they are safe\n    To have inside the house with doors unlocked.\n    I'm not afraid of them, though, if they're not\n    Afraid of me. There's two can play at that.\n    I have my fancies: it runs in the family.\n    My father's brother wasn't right. They kept him\n    Locked up for years back there at the old farm.\n    I've been away once--yes, I've been away.\n    The State Asylum. I was prejudiced;\n    I wouldn't have sent anyone of mine there;\n    You know the old idea--the only asylum\n    Was the poorhouse, and those who could afford,\n    Rather than send their folks to such a place,\n    Kept them at home; and it does seem more human.\n    But it's not so: the place is the asylum.\n    There they have every means proper to do with,\n    And you aren't darkening other people's lives--\n    Worse than no good to them, and they no good\n    To you in your condition; you can't know\n    Affection or the want of it in that state.\n    I've heard too much of the old-fashioned way.\n    My father's brother, he went mad quite young.\n    Some thought he had been bitten by a dog,\n    Because his violence took on the form\n    Of carrying his pillow in his teeth;\n    But it's more likely he was crossed in love,\n    Or so the story goes. It was some girl.\n    Anyway all he talked about was love.\n    They soon saw he would do someone a mischief\n    If he wa'n't kept strict watch of, and it ended\n    In father's building him a sort of cage,\n    Or room within a room, of hickory poles,\n    Like stanchions in the barn, from floor to ceiling,--\n    A narrow passage all the way around.\n    Anything they put in for furniture\n    He'd tear to pieces, even a bed to lie on.\n    So they made the place comfortable with straw,\n    Like a beast's stall, to ease their consciences.\n    Of course they had to feed him without dishes.\n    They tried to keep him clothed, but he paraded\n    With his clothes on his arm--all of his clothes.\n    Cruel--it sounds. I 'spose they did the best\n    They knew. And just when he was at the height,\n    Father and mother married, and mother came,\n    A bride, to help take care of such a creature,\n    And accommodate her young life to his.\n    That was what marrying father meant to her.\n    She had to lie and hear love things made dreadful\n    By his shouts in the night. He'd shout and shout\n    Until the strength was shouted out of him,\n    And his voice died down slowly from exhaustion.\n    He'd pull his bars apart like bow and bow-string,\n    And let them go and make them twang until\n    His hands had worn them smooth as any ox-bow.\n    And then he'd crow as if he thought that child's play--\n    The only fun he had. I've heard them say, though,\n    They found a way to put a stop to it.\n    He was before my time--I never saw him;\n    But the pen stayed exactly as it was\n    There in the upper chamber in the ell,\n    A sort of catch-all full of attic clutter.\n    I often think of the smooth hickory bars.\n    It got so I would say--you know, half fooling--\n    \"It's time I took my turn upstairs in jail\"--\n    Just as you will till it becomes a habit.\n    No wonder I was glad to get away.\n    Mind you, I waited till Len said the word.\n    I didn't want the blame if things went wrong.\n    I was glad though, no end, when we moved out,\n    And I looked to be happy, and I was,\n    As I said, for a while--but I don't know!\n    Somehow the change wore out like a prescription.\n    And there's more to it than just window-views\n    And living by a lake. I'm past such help--\n    Unless Len took the notion, which he won't,\n    And I won't ask him--it's not sure enough.\n    I 'spose I've got to go the road I'm going:\n    Other folks have to, and why shouldn't I?\n    I almost think if I could do like you,\n    Drop everything and live out on the ground--\n    But it might be, come night, I shouldn't like it,\n    Or a long rain. I should soon get enough,\n    And be glad of a good roof overhead.\n    I've lain awake thinking of you, I'll warrant,\n    More than you have yourself, some of these nights.\n    The wonder was the tents weren't snatched away\n    From over you as you lay in your beds.\n    I haven't courage for a risk like that.\n    Bless you, of course, you're keeping me from work,\n    But the thing of it is, I need to be kept.\n    There's work enough to do--there's always that;\n    But behind's behind. The worst that you can do\n    Is set me back a little more behind.\n    I sha'n't catch up in this world, anyway.\n    I'd rather you'd not go unless you must.\n\n\n\n\nAfter Apple-picking\n\n    MY long two-pointed ladder's sticking through a tree\n    Toward heaven still,\n    And there's a barrel that I didn't fill\n    Beside it, and there may be two or three\n    Apples I didn't pick upon some bough.\n    But I am done with apple-picking now.\n    Essence of winter sleep is on the night,\n    The scent of apples: I am drowsing off.\n    I cannot rub the strangeness from my sight\n    I got from looking through a pane of glass\n    I skimmed this morning from the drinking trough\n    And held against the world of hoary grass.\n    It melted, and I let it fall and break.\n    But I was well\n    Upon my way to sleep before it fell,\n    And I could tell\n    What form my dreaming was about to take.\n    Magnified apples appear and disappear,\n    Stem end and blossom end,\n    And every fleck of russet showing clear.\n    My instep arch not only keeps the ache,\n    It keeps the pressure of a ladder-round.\n    I feel the ladder sway as the boughs bend.\n    And I keep hearing from the cellar bin\n    The rumbling sound\n    Of load on load of apples coming in.\n    For I have had too much\n    Of apple-picking: I am overtired\n    Of the great harvest I myself desired.\n    There were ten thousand thousand fruit to touch,\n    Cherish in hand, lift down, and not let fall.\n    For all\n    That struck the earth,\n    No matter if not bruised or spiked with stubble,\n    Went surely to the cider-apple heap\n    As of no worth.\n    One can see what will trouble\n    This sleep of mine, whatever sleep it is.\n    Were he not gone,\n    The woodchuck could say whether it's like his\n    Long sleep, as I describe its coming on,\n    Or just some human sleep.\n\n\n\n\nThe Code\n\n    THERE were three in the meadow by the brook\n    Gathering up windrows, piling cocks of hay,\n    With an eye always lifted toward the west\n    Where an irregular sun-bordered cloud\n    Darkly advanced with a perpetual dagger\n    Flickering across its bosom. Suddenly\n    One helper, thrusting pitchfork in the ground,\n    Marched himself off the field and home. One stayed.\n    The town-bred farmer failed to understand.\n    \"What is there wrong?\"\n    \"Something you just now said.\"\n    \"What did I say?\"\n    \"About our taking pains.\"\n    \"To cock the hay?--because it's going to shower?\n    I said that more than half an hour ago.\n    I said it to myself as much as you.\"\n    \"You didn't know. But James is one big fool.\n    He thought you meant to find fault with his work.\n    That's what the average farmer would have meant.\n    James would take time, of course, to chew it over\n    Before he acted: he's just got round to act.\"\n    \"He is a fool if that's the way he takes me.\"\n    \"Don't let it bother you. You've found out something.\n    The hand that knows his business won't be told\n    To do work better or faster--those two things.\n    I'm as particular as anyone:\n    Most likely I'd have served you just the same.\n    But I know you don't understand our ways.\n    You were just talking what was in your mind,\n    What was in all our minds, and you weren't hinting.\n    Tell you a story of what happened once:\n    I was up here in Salem at a man's\n    Named Sanders with a gang of four or five\n    Doing the haying. No one liked the boss.\n    He was one of the kind sports call a spider,\n    All wiry arms and legs that spread out wavy\n    From a humped body nigh as big's a biscuit.\n    But work! that man could work, especially\n    If by so doing he could get more work\n    Out of his hired help. I'm not denying\n    He was hard on himself. I couldn't find\n    That he kept any hours--not for himself.\n    Daylight and lantern-light were one to him:\n    I've heard him pounding in the barn all night.\n    But what he liked was someone to encourage.\n    Them that he couldn't lead he'd get behind\n    And drive, the way you can, you know, in mowing--\n    Keep at their heels and threaten to mow their legs off.\n    I'd seen about enough of his bulling tricks\n    (We call that bulling). I'd been watching him.\n    So when he paired off with me in the hayfield\n    To load the load, thinks I, Look out for trouble.\n    I built the load and topped it off; old Sanders\n    Combed it down with a rake and says, 'O. K.'\n    Everything went well till we reached the barn\n    With a big catch to empty in a bay.\n    You understand that meant the easy job\n    For the man up on top of throwing down\n    The hay and rolling it off wholesale,\n    Where on a mow it would have been slow lifting.\n    You wouldn't think a fellow'd need much urging\n    Under these circumstances, would you now?\n    But the old fool seizes his fork in both hands,\n    And looking up bewhiskered out of the pit,\n    Shouts like an army captain, 'Let her come!'\n    Thinks I, D'ye mean it? 'What was that you said?'\n    I asked out loud, so's there'd be no mistake,\n    'Did you say, Let her come?' 'Yes, let her come.'\n    He said it over, but he said it softer.\n    Never you say a thing like that to a man,\n    Not if he values what he is. God, I'd as soon\n    Murdered him as left out his middle name.\n    I'd built the load and knew right where to find it.\n    Two or three forkfuls I picked lightly round for\n    Like meditating, and then I just dug in\n    And dumped the rackful on him in ten lots.\n    I looked over the side once in the dust\n    And caught sight of him treading-water-like,\n    Keeping his head above. 'Damn ye,' I says,\n    'That gets ye!' He squeaked like a squeezed rat.\n    That was the last I saw or heard of him.\n    I cleaned the rack and drove out to cool off.\n    As I sat mopping hayseed from my neck,\n    And sort of waiting to be asked about it,\n    One of the boys sings out, 'Where's the old man?'\n    'I left him in the barn under the hay.\n    If ye want him, ye can go and dig him out.'\n    They realized from the way I swobbed my neck\n    More than was needed something must be up.\n    They headed for the barn; I stayed where I was.\n    They told me afterward. First they forked hay,\n    A lot of it, out into the barn floor.\n    Nothing! They listened for him. Not a rustle.\n    I guess they thought I'd spiked him in the temple\n    Before I buried him, or I couldn't have managed.\n    They excavated more. 'Go keep his wife\n    Out of the barn.' Someone looked in a window,\n    And curse me if he wasn't in the kitchen\n    Slumped way down in a chair, with both his feet\n    Stuck in the oven, the hottest day that summer.\n    He looked so clean disgusted from behind\n    There was no one that dared to stir him up,\n    Or let him know that he was being looked at.\n    Apparently I hadn't buried him\n    (I may have knocked him down); but my just trying\n    To bury him had hurt his dignity.\n    He had gone to the house so's not to meet me.\n    He kept away from us all afternoon.\n    We tended to his hay. We saw him out\n    After a while picking peas in his garden:\n    He couldn't keep away from doing something.\"\n    \"Weren't you relieved to find he wasn't dead?\"\n    \"No! and yet I don't know--it's hard to say.\n    I went about to kill him fair enough.\"\n    \"You took an awkward way. Did he discharge you?\"\n    \"Discharge me? No! He knew I did just right.\"\n\n\n\n\nThe Generations of Men\n\n    A GOVERNOR it was proclaimed this time,\n    When all who would come seeking in New Hampshire\n    Ancestral memories might come together.\n    And those of the name Stark gathered in Bow,\n    A rock-strewn town where farming has fallen off,\n    And sprout-lands flourish where the axe has gone.\n    Someone had literally run to earth\n    In an old cellar hole in a by-road\n    The origin of all the family there.\n    Thence they were sprung, so numerous a tribe\n    That now not all the houses left in town\n    Made shift to shelter them without the help\n    Of here and there a tent in grove and orchard.\n    They were at Bow, but that was not enough:\n    Nothing would do but they must fix a day\n    To stand together on the crater's verge\n    That turned them on the world, and try to fathom\n    The past and get some strangeness out of it.\n    But rain spoiled all. The day began uncertain,\n    With clouds low trailing and moments of rain that misted.\n    The young folk held some hope out to each other\n    Till well toward noon when the storm settled down\n    With a swish in the grass. \"What if the others\n    Are there,\" they said. \"It isn't going to rain.\"\n    Only one from a farm not far away\n    Strolled thither, not expecting he would find\n    Anyone else, but out of idleness.\n    One, and one other, yes, for there were two.\n    The second round the curving hillside road\n    Was a girl; and she halted some way off\n    To reconnoitre, and then made up her mind\n    At least to pass by and see who he was,\n    And perhaps hear some word about the weather.\n    This was some Stark she didn't know. He nodded.\n    \"No fete to-day,\" he said.\n    \"It looks that way.\"\n    She swept the heavens, turning on her heel.\n    \"I only idled down.\"\n    \"I idled down.\"\n    Provision there had been for just such meeting\n    Of stranger cousins, in a family tree\n    Drawn on a sort of passport with the branch\n    Of the one bearing it done in detail--\n    Some zealous one's laborious device.\n    She made a sudden movement toward her bodice,\n    As one who clasps her heart. They laughed together.\n    \"Stark?\" he inquired. \"No matter for the proof.\"\n    \"Yes, Stark. And you?\"\n    \"I'm Stark.\" He drew his passport.\n    \"You know we might not be and still be cousins:\n    The town is full of Chases, Lowes, and Baileys,\n    All claiming some priority in Starkness.\n    My mother was a Lane, yet might have married\n    Anyone upon earth and still her children\n    Would have been Starks, and doubtless here to-day.\"\n    \"You riddle with your genealogy\n    Like a Viola. I don't follow you.\"\n    \"I only mean my mother was a Stark\n    Several times over, and by marrying father\n    No more than brought us back into the name.\"\n    \"One ought not to be thrown into confusion\n    By a plain statement of relationship,\n    But I own what you say makes my head spin.\n    You take my card--you seem so good at such things--\n    And see if you can reckon our cousinship.\n    Why not take seats here on the cellar wall\n    And dangle feet among the raspberry vines?\"\n    \"Under the shelter of the family tree.\"\n    \"Just so--that ought to be enough protection.\"\n    \"Not from the rain. I think it's going to rain.\"\n    \"It's raining.\"\n    \"No, it's misting; let's be fair.\n    Does the rain seem to you to cool the eyes?\"\n    The situation was like this: the road\n    Bowed outward on the mountain half-way up,\n    And disappeared and ended not far off.\n    No one went home that way. The only house\n    Beyond where they were was a shattered seedpod.\n    And below roared a brook hidden in trees,\n    The sound of which was silence for the place.\n    This he sat listening to till she gave judgment.\n    \"On father's side, it seems, we're--let me see----\"\n    \"Don't be too technical.--You have three cards.\"\n    \"Four cards, one yours, three mine, one for each branch\n    Of the Stark family I'm a member of.\"\n    \"D'you know a person so related to herself\n    Is supposed to be mad.\"\n    \"I may be mad.\"\n    \"You look so, sitting out here in the rain\n    Studying genealogy with me\n    You never saw before. What will we come to\n    With all this pride of ancestry, we Yankees?\n    I think we're all mad. Tell me why we're here\n    Drawn into town about this cellar hole\n    Like wild geese on a lake before a storm?\n    What do we see in such a hole, I wonder.\"\n    \"The Indians had a myth of Chicamoztoc,\n    Which means The Seven Caves that We Came out of.\n    This is the pit from which we Starks were digged.\"\n    \"You must be learned. That's what you see in it?\"\n    \"And what do you see?\"\n    \"Yes, what do I see?\n    First let me look. I see raspberry vines----\"\n    \"Oh, if you're going to use your eyes, just hear\n    What I see. It's a little, little boy,\n    As pale and dim as a match flame in the sun;\n    He's groping in the cellar after jam,\n    He thinks it's dark and it's flooded with daylight.\"\n    \"He's nothing. Listen. When I lean like this\n    I can make out old Grandsir Stark distinctly,--\n    With his pipe in his mouth and his brown jug--\n    Bless you, it isn't Grandsir Stark, it's Granny,\n    But the pipe's there and smoking and the jug.\n    She's after cider, the old girl, she's thirsty;\n    Here's hoping she gets her drink and gets out safely.\"\n    \"Tell me about her. Does she look like me?\"\n    \"She should, shouldn't she, you're so many times\n    Over descended from her. I believe\n    She does look like you. Stay the way you are.\n    The nose is just the same, and so's the chin--\n    Making allowance, making due allowance.\"\n    \"You poor, dear, great, great, great, great Granny!\"\n    \"See that you get her greatness right. Don't stint her.\"\n    \"Yes, it's important, though you think it isn't.\n    I won't be teased. But see how wet I am.\"\n    \"Yes, you must go; we can't stay here for ever.\n    But wait until I give you a hand up.\n    A bead of silver water more or less\n    Strung on your hair won't hurt your summer looks.\n    I wanted to try something with the noise\n    That the brook raises in the empty valley.\n    We have seen visions--now consult the voices.\n    Something I must have learned riding in trains\n    When I was young. I used the roar\n    To set the voices speaking out of it,\n    Speaking or singing, and the band-music playing.\n    Perhaps you have the art of what I mean.\n    I've never listened in among the sounds\n    That a brook makes in such a wild descent.\n    It ought to give a purer oracle.\"\n    \"It's as you throw a picture on a screen:\n    The meaning of it all is out of you;\n    The voices give you what you wish to hear.\"\n    \"Strangely, it's anything they wish to give.\"\n    \"Then I don't know. It must be strange enough.\n    I wonder if it's not your make-believe.\n    What do you think you're like to hear to-day?\"\n    \"From the sense of our having been together--\n    But why take time for what I'm like to hear?\n    I'll tell you what the voices really say.\n    You will do very well right where you are\n    A little longer. I mustn't feel too hurried,\n    Or I can't give myself to hear the voices.\"\n    \"Is this some trance you are withdrawing into?\"\n    \"You must be very still; you mustn't talk.\"\n    \"I'll hardly breathe.\"\n    \"The voices seem to say----\"\n    \"I'm waiting.\"\n    \"Don't! The voices seem to say:\n    Call her Nausicaa, the unafraid\n    Of an acquaintance made adventurously.\"\n    \"I let you say that--on consideration.\"\n    \"I don't see very well how you can help it.\n    You want the truth. I speak but by the voices.\n    You see they know I haven't had your name,\n    Though what a name should matter between us----\"\n    \"I shall suspect----\"\n    \"Be good. The voices say:\n    Call her Nausicaa, and take a timber\n    That you shall find lies in the cellar charred\n    Among the raspberries, and hew and shape it\n    For a door-sill or other corner piece\n    In a new cottage on the ancient spot.\n    The life is not yet all gone out of it.\n    And come and make your summer dwelling here,\n    And perhaps she will come, still unafraid,\n    And sit before you in the open door\n    With flowers in her lap until they fade,\n    But not come in across the sacred sill----\"\n    \"I wonder where your oracle is tending.\n    You can see that there's something wrong with it,\n    Or it would speak in dialect. Whose voice\n    Does it purport to speak in? Not old Grandsir's\n    Nor Granny's, surely. Call up one of them.\n    They have best right to be heard in this place.\"\n    \"You seem so partial to our great-grandmother\n    (Nine times removed. Correct me if I err.)\n    You will be likely to regard as sacred\n    Anything she may say. But let me warn you,\n    Folks in her day were given to plain speaking.\n    You think you'd best tempt her at such a time?\"\n    \"It rests with us always to cut her off.\"\n    \"Well then, it's Granny speaking: 'I dunnow!\n    Mebbe I'm wrong to take it as I do.\n    There ain't no names quite like the old ones though,\n    Nor never will be to my way of thinking.\n    One mustn't bear too hard on the new comers,\n    But there's a dite too many of them for comfort.\n    I should feel easier if I could see\n    More of the salt wherewith they're to be salted.\n    Son, you do as you're told! You take the timber--\n    It's as sound as the day when it was cut--\n    And begin over----' There, she'd better stop.\n    You can see what is troubling Granny, though.\n    But don't you think we sometimes make too much\n    Of the old stock? What counts is the ideals,\n    And those will bear some keeping still about.\"\n    \"I can see we are going to be good friends.\"\n    \"I like your 'going to be.' You said just now\n    It's going to rain.\"\n    \"I know, and it was raining.\n    I let you say all that. But I must go now.\"\n    \"You let me say it? on consideration?\n    How shall we say good-bye in such a case?\"\n    \"How shall we?\"\n    \"Will you leave the way to me?\"\n    \"No, I don't trust your eyes. You've said enough.\n    Now give me your hand up.--Pick me that flower.\"\n    \"Where shall we meet again?\"\n    \"Nowhere but here\n    Once more before we meet elsewhere.\"\n    \"In rain?\"\n    \"It ought to be in rain. Sometime in rain.\n    In rain to-morrow, shall we, if it rains?\n    But if we must, in sunshine.\" So she went.\n\n\n\n\nThe Housekeeper\n\n    I LET myself in at the kitchen door.\n    \"It's you,\" she said. \"I can't get up. Forgive me\n    Not answering your knock. I can no more\n    Let people in than I can keep them out.\n    I'm getting too old for my size, I tell them.\n    My fingers are about all I've the use of\n    So's to take any comfort. I can sew:\n    I help out with this beadwork what I can.\"\n    \"That's a smart pair of pumps you're beading there.\n    Who are they for?\"\n    \"You mean?--oh, for some miss.\n    I can't keep track of other people's daughters.\n    Lord, if I were to dream of everyone\n    Whose shoes I primped to dance in!\"\n    \"And where's John?\"\n    \"Haven't you seen him? Strange what set you off\n    To come to his house when he's gone to yours.\n    You can't have passed each other. I know what:\n    He must have changed his mind and gone to Garlands.\n    He won't be long in that case. You can wait.\n    Though what good you can be, or anyone--\n    It's gone so far. You've heard? Estelle's run off.\"\n    \"Yes, what's it all about? When did she go?\"\n    \"Two weeks since.\"\n    \"She's in earnest, it appears.\"\n    \"I'm sure she won't come back. She's hiding somewhere.\n    I don't know where myself. John thinks I do.\n    He thinks I only have to say the word,\n    And she'll come back. But, bless you, I'm her mother--\n    I can't talk to her, and, Lord, if I could!\"\n    \"It will go hard with John. What will he do?\n    He can't find anyone to take her place.\"\n    \"Oh, if you ask me that, what will he do?\n    He gets some sort of bakeshop meals together,\n    With me to sit and tell him everything,\n    What's wanted and how much and where it is.\n    But when I'm gone--of course I can't stay here:\n    Estelle's to take me when she's settled down.\n    He and I only hinder one another.\n    I tell them they can't get me through the door, though:\n    I've been built in here like a big church organ.\n    We've been here fifteen years.\"\n    \"That's a long time\n    To live together and then pull apart.\n    How do you see him living when you're gone?\n    Two of you out will leave an empty house.\"\n    \"I don't just see him living many years,\n    Left here with nothing but the furniture.\n    I hate to think of the old place when we're gone,\n    With the brook going by below the yard,\n    And no one here but hens blowing about.\n    If he could sell the place, but then, he can't:\n    No one will ever live on it again.\n    It's too run down. This is the last of it.\n    What I think he will do, is let things smash.\n    He'll sort of swear the time away. He's awful!\n    I never saw a man let family troubles\n    Make so much difference in his man's affairs.\n    He's just dropped everything. He's like a child.\n    I blame his being brought up by his mother.\n    He's got hay down that's been rained on three times.\n    He hoed a little yesterday for me:\n    I thought the growing things would do him good.\n    Something went wrong. I saw him throw the hoe\n    Sky-high with both hands. I can see it now--\n    Come here--I'll show you--in that apple tree.\n    That's no way for a man to do at his age:\n    He's fifty-five, you know, if he's a day.\"\n    \"Aren't you afraid of him? What's that gun for?\"\n    \"Oh, that's been there for hawks since chicken-time.\n    John Hall touch me! Not if he knows his friends.\n    I'll say that for him, John's no threatener\n    Like some men folk. No one's afraid of him;\n    All is, he's made up his mind not to stand\n    What he has got to stand.\"\n    \"Where is Estelle?\n    Couldn't one talk to her? What does she say?\n    You say you don't know where she is.\"\n    \"Nor want to!\n    She thinks if it was bad to live with him,\n    It must be right to leave him.\"\n    \"Which is wrong!\"\n    \"Yes, but he should have married her.\"\n    \"I know.\"\n    \"The strain's been too much for her all these years:\n    I can't explain it any other way.\n    It's different with a man, at least with John:\n    He knows he's kinder than the run of men.\n    Better than married ought to be as good\n    As married--that's what he has always said.\n    I know the way he's felt--but all the same!\"\n    \"I wonder why he doesn't marry her\n    And end it.\"\n    \"Too late now: she wouldn't have him.\n    He's given her time to think of something else.\n    That's his mistake. The dear knows my interest\n    Has been to keep the thing from breaking up.\n    This is a good home: I don't ask for better.\n    But when I've said, 'Why shouldn't they be married,'\n    He'd say, 'Why should they?' no more words than that.\"\n    \"And after all why should they? John's been fair\n    I take it. What was his was always hers.\n    There was no quarrel about property.\"\n    \"Reason enough, there was no property.\n    A friend or two as good as own the farm,\n    Such as it is. It isn't worth the mortgage.\"\n    \"I mean Estelle has always held the purse.\"\n    \"The rights of that are harder to get at.\n    I guess Estelle and I have filled the purse.\n    'Twas we let him have money, not he us.\n    John's a bad farmer. I'm not blaming him.\n    Take it year in, year out, he doesn't make much.\n    We came here for a home for me, you know,\n    Estelle to do the housework for the board\n    Of both of us. But look how it turns out:\n    She seems to have the housework, and besides,\n    Half of the outdoor work, though as for that,\n    He'd say she does it more because she likes it.\n    You see our pretty things are all outdoors.\n    Our hens and cows and pigs are always better\n    Than folks like us have any business with.\n    Farmers around twice as well off as we\n    Haven't as good. They don't go with the farm.\n    One thing you can't help liking about John,\n    He's fond of nice things--too fond, some would say.\n    But Estelle don't complain: she's like him there.\n    She wants our hens to be the best there are.\n    You never saw this room before a show,\n    Full of lank, shivery, half-drowned birds\n    In separate coops, having their plumage done.\n    The smell of the wet feathers in the heat!\n    You spoke of John's not being safe to stay with.\n    You don't know what a gentle lot we are:\n    We wouldn't hurt a hen! You ought to see us\n    Moving a flock of hens from place to place.\n    We're not allowed to take them upside down,\n    All we can hold together by the legs.\n    Two at a time's the rule, one on each arm,\n    No matter how far and how many times\n    We have to go.\"\n    \"You mean that's John's idea.\"\n    \"And we live up to it; or I don't know\n    What childishness he wouldn't give way to.\n    He manages to keep the upper hand\n    On his own farm. He's boss. But as to hens:\n    We fence our flowers in and the hens range.\n    Nothing's too good for them. We say it pays.\n    John likes to tell the offers he has had,\n    Twenty for this cock, twenty-five for that.\n    He never takes the money. If they're worth\n    That much to sell, they're worth as much to keep.\n    Bless you, it's all expense, though. Reach me down\n    The little tin box on the cupboard shelf,\n    The upper shelf, the tin box. That's the one.\n    I'll show you. Here you are.\"\n    \"What's this?\"\n    \"A bill--\n    For fifty dollars for one Langshang cock--\n    Receipted. And the cock is in the yard.\"\n    \"Not in a glass case, then?\"\n    \"He'd need a tall one:\n    He can eat off a barrel from the ground.\n    He's been in a glass case, as you may say,\n    The Crystal Palace, London. He's imported.\n    John bought him, and we paid the bill with beads--\n    Wampum, I call it. Mind, we don't complain.\n    But you see, don't you, we take care of him.\"\n    \"And like it, too. It makes it all the worse.\"\n    \"It seems as if. And that's not all: he's helpless\n    In ways that I can hardly tell you of.\n    Sometimes he gets possessed to keep accounts\n    To see where all the money goes so fast.\n    You know how men will be ridiculous.\n    But it's just fun the way he gets bedeviled--\n    If he's untidy now, what will he be----?\n    \"It makes it all the worse. You must be blind.\"\n    \"Estelle's the one. You needn't talk to me.\"\n    \"Can't you and I get to the root of it?\n    What's the real trouble? What will satisfy her?\"\n    \"It's as I say: she's turned from him, that's all.\"\n    \"But why, when she's well off? Is it the neighbours,\n    Being cut off from friends?\"\n    \"We have our friends.\n    That isn't it. Folks aren't afraid of us.\"\n    \"She's let it worry her. You stood the strain,\n    And you're her mother.\"\n    \"But I didn't always.\n    I didn't relish it along at first.\n    But I got wonted to it. And besides--\n    John said I was too old to have grandchildren.\n    But what's the use of talking when it's done?\n    She won't come back--it's worse than that--she can't.\"\n    \"Why do you speak like that? What do you know?\n    What do you mean?--she's done harm to herself?\"\n    \"I mean she's married--married someone else.\"\n    \"Oho, oho!\"\n    \"You don't believe me.\"\n    \"Yes, I do,\n    Only too well. I knew there must be something!\n    So that was what was back. She's bad, that's all!\"\n    \"Bad to get married when she had the chance?\"\n    \"Nonsense! See what's she done! But who, who----\"\n    \"Who'd marry her straight out of such a mess?\n    Say it right out--no matter for her mother.\n    The man was found. I'd better name no names.\n    John himself won't imagine who he is.\"\n    \"Then it's all up. I think I'll get away.\n    You'll be expecting John. I pity Estelle;\n    I suppose she deserves some pity, too.\n    You ought to have the kitchen to yourself\n    To break it to him. You may have the job.\"\n    \"You needn't think you're going to get away.\n    John's almost here. I've had my eye on someone\n    Coming down Ryan's Hill. I thought 'twas him.\n    Here he is now. This box! Put it away.\n    And this bill.\"\n    \"What's the hurry? He'll unhitch.\"\n    \"No, he won't, either. He'll just drop the reins\n    And turn Doll out to pasture, rig and all.\n    She won't get far before the wheels hang up\n    On something--there's no harm. See, there he is!\n    My, but he looks as if he must have heard!\"\n    John threw the door wide but he didn't enter.\n    \"How are you, neighbour? Just the man I'm after.\n    Isn't it Hell,\" he said. \"I want to know.\n    Come out here if you want to hear me talk.\n    I'll talk to you, old woman, afterward.\n    I've got some news that maybe isn't news.\n    What are they trying to do to me, these two?\"\n    \"Do go along with him and stop his shouting.\"\n    She raised her voice against the closing door:\n    \"Who wants to hear your news, you--dreadful fool?\"\n\n\n\n\nThe Fear\n\n    A LANTERN light from deeper in the barn\n    Shone on a man and woman in the door\n    And threw their lurching shadows on a house\n    Near by, all dark in every glossy window.\n    A horse's hoof pawed once the hollow floor,\n    And the back of the gig they stood beside\n    Moved in a little. The man grasped a wheel,\n    The woman spoke out sharply, \"Whoa, stand still!\"\n    \"I saw it just as plain as a white plate,\"\n    She said, \"as the light on the dashboard ran\n    Along the bushes at the roadside--a man's face.\n    You must have seen it too.\"\n    \"I didn't see it.\n    Are you sure----\"\n    \"Yes, I'm sure!\"\n    \"--it was a face?\"\n    \"Joel, I'll have to look. I can't go in,\n    I can't, and leave a thing like that unsettled.\n    Doors locked and curtains drawn will make no difference.\n    I always have felt strange when we came home\n    To the dark house after so long an absence,\n    And the key rattled loudly into place\n    Seemed to warn someone to be getting out\n    At one door as we entered at another.\n    What if I'm right, and someone all the time--\n    Don't hold my arm!\"\n    \"I say it's someone passing.\"\n    \"You speak as if this were a travelled road.\n    You forget where we are. What is beyond\n    That he'd be going to or coming from\n    At such an hour of night, and on foot too.\n    What was he standing still for in the bushes?\"\n    \"It's not so very late--it's only dark.\n    There's more in it than you're inclined to say.\n    Did he look like----?\"\n    \"He looked like anyone.\n    I'll never rest to-night unless I know.\n    Give me the lantern.\"\n    \"You don't want the lantern.\"\n    She pushed past him and got it for herself.\n    \"You're not to come,\" she said. \"This is my business.\n    If the time's come to face it, I'm the one\n    To put it the right way. He'd never dare--\n    Listen! He kicked a stone. Hear that, hear that!\n    He's coming towards us. Joel, go in--please.\n    Hark!--I don't hear him now. But please go in.\"\n    \"In the first place you can't make me believe it's----\"\n    \"It is--or someone else he's sent to watch.\n    And now's the time to have it out with him\n    While we know definitely where he is.\n    Let him get off and he'll be everywhere\n    Around us, looking out of trees and bushes\n    Till I sha'n't dare to set a foot outdoors.\n    And I can't stand it. Joel, let me go!\"\n    \"But it's nonsense to think he'd care enough.\"\n    \"You mean you couldn't understand his caring.\n    Oh, but you see he hadn't had enough--\n    Joel, I won't--I won't--I promise you.\n    We mustn't say hard things. You mustn't either.\"\n    \"I'll be the one, if anybody goes!\n    But you give him the advantage with this light.\n    What couldn't he do to us standing here!\n    And if to see was what he wanted, why\n    He has seen all there was to see and gone.\"\n    He appeared to forget to keep his hold,\n    But advanced with her as she crossed the grass.\n    \"What do you want?\" she cried to all the dark.\n    She stretched up tall to overlook the light\n    That hung in both hands hot against her skirt.\n    \"There's no one; so you're wrong,\" he said.\n    \"There is.--\n    What do you want?\" she cried, and then herself\n    Was startled when an answer really came.\n    \"Nothing.\" It came from well along the road.\n    She reached a hand to Joel for support:\n    The smell of scorching woollen made her faint.\n    \"What are you doing round this house at night?\"\n    \"Nothing.\" A pause: there seemed no more to say.\n    And then the voice again: \"You seem afraid.\n    I saw by the way you whipped up the horse.\n    I'll just come forward in the lantern light\n    And let you see.\"\n    \"Yes, do.--Joel, go back!\"\n    She stood her ground against the noisy steps\n    That came on, but her body rocked a little.\n    \"You see,\" the voice said.\n    \"Oh.\" She looked and looked.\n    \"You don't see--I've a child here by the hand.\"\n    \"What's a child doing at this time of night----?\"\n    \"Out walking. Every child should have the memory\n    Of at least one long-after-bedtime walk.\n    What, son?\"\n    \"Then I should think you'd try to find\n    Somewhere to walk----\"\n    \"The highway as it happens--\n    We're stopping for the fortnight down at Dean's.\"\n    \"But if that's all--Joel--you realize--\n    You won't think anything. You understand?\n    You understand that we have to be careful.\n    This is a very, very lonely place.\n    Joel!\" She spoke as if she couldn't turn.\n    The swinging lantern lengthened to the ground,\n    It touched, it struck it, clattered and went out.\n\n\n\n\nThe Self-seeker\n\n    \"WILLIS, I didn't want you here to-day:\n    The lawyer's coming for the company.\n    I'm going to sell my soul, or, rather, feet.\n    Five hundred dollars for the pair, you know.\"\n    \"With you the feet have nearly been the soul;\n    And if you're going to sell them to the devil,\n    I want to see you do it. When's he coming?\"\n    \"I half suspect you knew, and came on purpose\n    To try to help me drive a better bargain.\"\n    \"Well, if it's true! Yours are no common feet.\n    The lawyer don't know what it is he's buying:\n    So many miles you might have walked you won't walk.\n    You haven't run your forty orchids down.\n    What does he think?--How are the blessed feet?\n    The doctor's sure you're going to walk again?\"\n    \"He thinks I'll hobble. It's both legs and feet.\"\n    \"They must be terrible--I mean to look at.\"\n    \"I haven't dared to look at them uncovered.\n    Through the bed blankets I remind myself\n    Of a starfish laid out with rigid points.\"\n    \"The wonder is it hadn't been your head.\"\n    \"It's hard to tell you how I managed it.\n    When I saw the shaft had me by the coat,\n    I didn't try too long to pull away,\n    Or fumble for my knife to cut away,\n    I just embraced the shaft and rode it out--\n    Till Weiss shut off the water in the wheel-pit.\n    That's how I think I didn't lose my head.\n    But my legs got their knocks against the ceiling.\"\n    \"Awful. Why didn't they throw off the belt\n    Instead of going clear down in the wheel-pit?\"\n    \"They say some time was wasted on the belt--\n    Old streak of leather--doesn't love me much\n    Because I make him spit fire at my knuckles,\n    The way Ben Franklin used to make the kite-string.\n    That must be it. Some days he won't stay on.\n    That day a woman couldn't coax him off.\n    He's on his rounds now with his tail in his mouth\n    Snatched right and left across the silver pulleys.\n    Everything goes the same without me there.\n    You can hear the small buzz saws whine, the big saw\n    Caterwaul to the hills around the village\n    As they both bite the wood. It's all our music.\n    One ought as a good villager to like it.\n    No doubt it has a sort of prosperous sound,\n    And it's our life.\"\n    \"Yes, when it's not our death.\"\n    \"You make that sound as if it wasn't so\n    With everything. What we live by we die by.\n    I wonder where my lawyer is. His train's in.\n    I want this over with; I'm hot and tired.\"\n    \"You're getting ready to do something foolish.\"\n    \"Watch for him, will you, Will? You let him in.\n    I'd rather Mrs. Corbin didn't know;\n    I've boarded here so long, she thinks she owns me.\n    You're bad enough to manage without her.\"\n    \"And I'm going to be worse instead of better.\n    You've got to tell me how far this is gone:\n    Have you agreed to any price?\"\n    \"Five hundred.\n    Five hundred--five--five! One, two, three, four, five.\n    You needn't look at me.\"\n    \"I don't believe you.\"\n    \"I told you, Willis, when you first came in.\n    Don't you be hard on me. I have to take\n    What I can get. You see they have the feet,\n    Which gives them the advantage in the trade.\n    I can't get back the feet in any case.\"\n    \"But your flowers, man, you're selling out your flowers.\"\n    \"Yes, that's one way to put it--all the flowers\n    Of every kind everywhere in this region\n    For the next forty summers--call it forty.\n    But I'm not selling those, I'm giving them,\n    They never earned me so much as one cent:\n    Money can't pay me for the loss of them.\n    No, the five hundred was the sum they named\n    To pay the doctor's bill and tide me over.\n    It's that or fight, and I don't want to fight--\n    I just want to get settled in my life,\n    Such as it's going to be, and know the worst,\n    Or best--it may not be so bad. The firm\n    Promise me all the shooks I want to nail.\"\n    \"But what about your flora of the valley?\"\n    \"You have me there. But that--you didn't think\n    That was worth money to me? Still I own\n    It goes against me not to finish it\n    For the friends it might bring me. By the way,\n    I had a letter from Burroughs--did I tell you?--\n    About my Cyprepedium reginae;\n    He says it's not reported so far north.\n    There! there's the bell. He's rung. But you go down\n    And bring him up, and don't let Mrs. Corbin.--\n    Oh, well, we'll soon be through with it. I'm tired.\"\n    Willis brought up besides the Boston lawyer\n    A little barefoot girl who in the noise\n    Of heavy footsteps in the old frame house,\n    And baritone importance of the lawyer,\n    Stood for a while unnoticed with her hands\n    Shyly behind her.\n    \"Well, and how is Mister----\"\n    The lawyer was already in his satchel\n    As if for papers that might bear the name\n    He hadn't at command. \"You must excuse me,\n    I dropped in at the mill and was detained.\"\n    \"Looking round, I suppose,\" said Willis.\n    \"Yes,\n    Well, yes.\"\n    \"Hear anything that might prove useful?\"\n    The Broken One saw Anne. \"Why, here is Anne.\n    What do you want, dear? Come, stand by the bed;\n    Tell me what is it?\" Anne just wagged her dress\n    With both hands held behind her. \"Guess,\" she said.\n    \"Oh, guess which hand? My my! Once on a time\n    I knew a lovely way to tell for certain\n    By looking in the ears. But I forget it.\n    Er, let me see. I think I'll take the right.\n    That's sure to be right even if it's wrong.\n    Come, hold it out. Don't change.--A Ram's Horn orchid!\n    A Ram's Horn! What would I have got, I wonder,\n    If I had chosen left. Hold out the left.\n    Another Ram's Horn! Where did you find those,\n    Under what beech tree, on what woodchuck's knoll?\"\n    Anne looked at the large lawyer at her side,\n    And thought she wouldn't venture on so much.\n    \"Were there no others?\"\n    \"There were four or five.\n    I knew you wouldn't let me pick them all.\"\n    \"I wouldn't--so I wouldn't. You're the girl!\n    You see Anne has her lesson learned by heart.\"\n    \"I wanted there should be some there next year.\"\n    \"Of course you did. You left the rest for seed,\n    And for the backwoods woodchuck. You're the girl!\n    A Ram's Horn orchid seedpod for a woodchuck\n    Sounds something like. Better than farmer's beans\n    To a discriminating appetite,\n    Though the Ram's Horn is seldom to be had\n    In bushel lots--doesn't come on the market.\n    But, Anne, I'm troubled; have you told me all?\n    You're hiding something. That's as bad as lying.\n    You ask this lawyer man. And it's not safe\n    With a lawyer at hand to find you out.\n    Nothing is hidden from some people, Anne.\n    You don't tell me that where you found a Ram's Horn\n    You didn't find a Yellow Lady's Slipper.\n    What did I tell you? What? I'd blush, I would.\n    Don't you defend yourself. If it was there,\n    Where is it now, the Yellow Lady's Slipper?\"\n    \"Well, wait--it's common--it's too common.\"\n    \"Common?\n    The Purple Lady's Slipper's commoner.\"\n    \"I didn't bring a Purple Lady's Slipper\n    To You--to you I mean--they're both too common.\"\n    The lawyer gave a laugh among his papers\n    As if with some idea that she had scored.\n    \"I've broken Anne of gathering bouquets.\n    It's not fair to the child. It can't be helped though:\n    Pressed into service means pressed out of shape.\n    Somehow I'll make it right with her--she'll see.\n    She's going to do my scouting in the field,\n    Over stone walls and all along a wood\n    And by a river bank for water flowers,\n    The floating Heart, with small leaf like a heart,\n    And at the sinus under water a fist\n    Of little fingers all kept down but one,\n    And that thrust up to blossom in the sun\n    As if to say, 'You! You're the Heart's desire.'\n    Anne has a way with flowers to take the place\n    Of that she's lost: she goes down on one knee\n    And lifts their faces by the chin to hers\n    And says their names, and leaves them where they are.\"\n    The lawyer wore a watch the case of which\n    Was cunningly devised to make a noise\n    Like a small pistol when he snapped it shut\n    At such a time as this. He snapped it now.\n    \"Well, Anne, go, dearie. Our affair will wait.\n    The lawyer man is thinking of his train.\n    He wants to give me lots and lots of money\n    Before he goes, because I hurt myself,\n    And it may take him I don't know how long.\n    But put our flowers in water first. Will, help her:\n    The pitcher's too full for her. There's no cup?\n    Just hook them on the inside of the pitcher.\n    Now run.--Get out your documents! You see\n    I have to keep on the good side of Anne.\n    I'm a great boy to think of number one.\n    And you can't blame me in the place I'm in.\n    Who will take care of my necessities\n    Unless I do?\"\n    \"A pretty interlude,\"\n    The lawyer said. \"I'm sorry, but my train--\n    Luckily terms are all agreed upon.\n    You only have to sign your name. Right--there.\"\n    \"You, Will, stop making faces. Come round here\n    Where you can't make them. What is it you want?\n    I'll put you out with Anne. Be good or go.\"\n    \"You don't mean you will sign that thing unread?\"\n    \"Make yourself useful then, and read it for me.\n    Isn't it something I have seen before?\"\n    \"You'll find it is. Let your friend look at it.\"\n    \"Yes, but all that takes time, and I'm as much\n    In haste to get it over with as you.\n    But read it, read it. That's right, draw the curtain:\n    Half the time I don't know what's troubling me.--\n    What do you say, Will? Don't you be a fool,\n    You! crumpling folkses legal documents.\n    Out with it if you've any real objection.\"\n    \"Five hundred dollars!\"\n    \"What would you think right?\"\n    \"A thousand wouldn't be a cent too much;\n    You know it, Mr. Lawyer. The sin is\n    Accepting anything before he knows\n    Whether he's ever going to walk again.\n    It smells to me like a dishonest trick.\"\n    \"I think--I think--from what I heard to-day--\n    And saw myself--he would be ill-advised----\"\n    \"What did you hear, for instance?\" Willis said.\n    \"Now the place where the accident occurred----\"\n    The Broken One was twisted in his bed.\n    \"This is between you two apparently.\n    Where I come in is what I want to know.\n    You stand up to it like a pair of cocks.\n    Go outdoors if you want to fight. Spare me.\n    When you come back, I'll have the papers signed.\n    Will pencil do? Then, please, your fountain pen.\n    One of you hold my head up from the pillow.\"\n    Willis flung off the bed. \"I wash my hands--\n    I'm no match--no, and don't pretend to be----\"\n    The lawyer gravely capped his fountain pen.\n    \"You're doing the wise thing: you won't regret it.\n    We're very sorry for you.\"\n    Willis sneered:\n    \"Who's we?--some stockholders in Boston?\n    I'll go outdoors, by gad, and won't come back.\"\n    \"Willis, bring Anne back with you when you come.\n    Yes. Thanks for caring. Don't mind Will: he's savage.\n    He thinks you ought to pay me for my flowers.\n    You don't know what I mean about the flowers.\n    Don't stop to try to now. You'll miss your train.\n    Good-bye.\" He flung his arms around his face.\n\n\n\n\nThe Wood-pile\n\n    OUT walking in the frozen swamp one grey day\n    I paused and said, \"I will turn back from here.\n    No, I will go on farther--and we shall see.\"\n    The hard snow held me, save where now and then\n    One foot went down. The view was all in lines\n    Straight up and down of tall slim trees\n    Too much alike to mark or name a place by\n    So as to say for certain I was here\n    Or somewhere else: I was just far from home.\n    A small bird flew before me. He was careful\n    To put a tree between us when he lighted,\n    And say no word to tell me who he was\n    Who was so foolish as to think what he thought.\n    He thought that I was after him for a feather--\n    The white one in his tail; like one who takes\n    Everything said as personal to himself.\n    One flight out sideways would have undeceived him.\n    And then there was a pile of wood for which\n    I forgot him and let his little fear\n    Carry him off the way I might have gone,\n    Without so much as wishing him good-night.\n    He went behind it to make his last stand.\n    It was a cord of maple, cut and split\n    And piled--and measured, four by four by eight.\n    And not another like it could I see.\n    No runner tracks in this year's snow looped near it.\n    And it was older sure than this year's cutting,\n    Or even last year's or the year's before.\n    The wood was grey and the bark warping off it\n    And the pile somewhat sunken. Clematis\n    Had wound strings round and round it like a bundle.\n    What held it though on one side was a tree\n    Still growing, and on one a stake and prop,\n    These latter about to fall. I thought that only\n    Someone who lived in turning to fresh tasks\n    Could so forget his handiwork on which\n    He spent himself, the labour of his axe,\n    And leave it there far from a useful fireplace\n    To warm the frozen swamp as best it could\n    With the slow smokeless burning of decay.\n\n\n\n\nGood Hours\n\n    I HAD for my winter evening walk--\n    No one at all with whom to talk,\n    But I had the cottages in a row\n    Up to their shining eyes in snow.\n    And I thought I had the folk within:\n    I had the sound of a violin;\n    I had a glimpse through curtain laces\n    Of youthful forms and youthful faces.\n    I had such company outward bound.\n    I went till there were no cottages found.\n    I turned and repented, but coming back\n    I saw no window but that was black.\n    Over the snow my creaking feet\n    Disturbed the slumbering village street\n    Like profanation, by your leave,\n    At ten o'clock of a winter eve.\n\n\n\n\n","id":"3026"},{"text":"\n\n\n\n\n  [Illustration: ROBERT FROST\n  From the original in plaster by AROLDO DU CHENE\n  _Copyright, Henry Holt and Company_]\n\n\n\n\n  MOUNTAIN INTERVAL\n\n\n  BY\n  ROBERT FROST\n\n\n  NEW YORK\n  HENRY HOLT AND COMPANY\n\n  COPYRIGHT, 1916, 1921\n  BY\n  HENRY HOLT AND COMPANY\n\n  _May, 1931_\n\n  PRINTED IN THE U. S. A. BY\n  THE QUINN & BODEN COMPANY\n  RAHWAY, N. J.\n\n       *       *       *       *       *\n\n\n  TO YOU\n  WHO LEAST NEED REMINDING\n\n  that before this interval of the South Branch under black\n  mountains, there was another interval, the Upper at Plymouth,\n  where we walked in spring beyond the covered bridge; but that\n  the first interval of all was the old farm, our brook interval,\n  so called by the man we had it from in sale.\n\n\n\n\nCONTENTS\n\n                                                                  PAGE\n  THE ROAD NOT TAKEN                                                 9\n  CHRISTMAS TREES                                                   11\n  AN OLD MAN'S WINTER NIGHT                                         14\n  A PATCH OF OLD SNOW                                               15\n  IN THE HOME STRETCH                                               16\n  THE TELEPHONE                                                     24\n  MEETING AND PASSING                                               25\n  HYLA BROOK                                                        26\n  THE OVEN BIRD                                                     27\n  BOND AND FREE                                                     28\n  BIRCHES                                                           29\n  PEA BRUSH                                                         31\n  PUTTING IN THE SEED                                               32\n  A TIME TO TALK                                                    33\n  THE COW IN APPLE TIME                                             34\n  AN ENCOUNTER                                                      35\n  RANGE-FINDING                                                     36\n  THE HILL WIFE                                                     37\n        I LONELINESS--HER WORD                                      37\n       II HOUSE FEAR                                                37\n      III THE SMILE--HER WORD                                       38\n       IV THE OFT-REPEATED DREAM                                    38\n        V THE IMPULSE                                               39\n  THE BONFIRE                                                       41\n  A GIRL'S GARDEN                                                   45\n  THE EXPOSED NEST                                                  48\n  \"OUT, OUT--\"                                                      50\n  BROWN'S DESCENT OR THE WILLY-NILLY SLIDE                          52\n  THE GUM-GATHERER                                                  56\n  THE LINE-GANG                                                     58\n  THE VANISHING RED                                                 59\n  SNOW                                                              61\n  THE SOUND OF THE TREES                                            75\n\n\n\n\n_THE ROAD NOT TAKEN_\n\n\n  _Two roads diverged in a yellow wood,\n  And sorry I could not travel both\n  And be one traveler, long I stood\n  And looked down one as far as I could\n  To where it bent in the undergrowth;_\n\n  _Then took the other, as just as fair,\n  And having perhaps the better claim,\n  Because it was grassy and wanted wear;\n  Though as for that the passing there\n  Had worn them really about the same,_\n\n  _And both that morning equally lay\n  In leaves no step had trodden black.\n  Oh, I kept the first for another day!\n  Yet knowing how way leads on to way,\n  I doubted if I should ever come back._\n\n  _I shall be telling this with a sigh\n  Somewhere ages and ages hence:\n  Two roads diverged in a wood, and I--\n  I took the one less traveled by,\n  And that has made all the difference._\n\n\n\n\nCHRISTMAS TREES\n\n(_A Christmas Circular Letter_)\n\n\n  The city had withdrawn into itself\n  And left at last the country to the country;\n  When between whirls of snow not come to lie\n  And whirls of foliage not yet laid, there drove\n  A stranger to our yard, who looked the city,\n  Yet did in country fashion in that there\n  He sat and waited till he drew us out\n  A-buttoning coats to ask him who he was.\n  He proved to be the city come again\n  To look for something it had left behind\n  And could not do without and keep its Christmas.\n  He asked if I would sell my Christmas trees;\n  My woods--the young fir balsams like a place\n  Where houses all are churches and have spires.\n  I hadn't thought of them as Christmas Trees.\n  I doubt if I was tempted for a moment\n  To sell them off their feet to go in cars\n  And leave the slope behind the house all bare,\n  Where the sun shines now no warmer than the moon.\n  I'd hate to have them know it if I was.\n  Yet more I'd hate to hold my trees except\n  As others hold theirs or refuse for them,\n  Beyond the time of profitable growth,\n  The trial by market everything must come to.\n  I dallied so much with the thought of selling.\n  Then whether from mistaken courtesy\n  And fear of seeming short of speech, or whether\n  From hope of hearing good of what was mine,\n  I said, \"There aren't enough to be worth while.\"\n  \"I could soon tell how many they would cut,\n  You let me look them over.\"\n\n                                     \"You could look.\n  But don't expect I'm going to let you have them.\"\n  Pasture they spring in, some in clumps too close\n  That lop each other of boughs, but not a few\n  Quite solitary and having equal boughs\n  All round and round. The latter he nodded \"Yes\" to,\n  Or paused to say beneath some lovelier one,\n  With a buyer's moderation, \"That would do.\"\n  I thought so too, but wasn't there to say so.\n  We climbed the pasture on the south, crossed over,\n  And came down on the north.\n\n                               He said, \"A thousand.\"\n\n  \"A thousand Christmas trees!--at what apiece?\"\n\n  He felt some need of softening that to me:\n  \"A thousand trees would come to thirty dollars.\"\n\n  Then I was certain I had never meant\n  To let him have them. Never show surprise!\n  But thirty dollars seemed so small beside\n  The extent of pasture I should strip, three cents\n  (For that was all they figured out apiece),\n  Three cents so small beside the dollar friends\n  I should be writing to within the hour\n  Would pay in cities for good trees like those,\n  Regular vestry-trees whole Sunday Schools\n  Could hang enough on to pick off enough.\n  A thousand Christmas trees I didn't know I had!\n  Worth three cents more to give away than sell,\n  As may be shown by a simple calculation.\n  Too bad I couldn't lay one in a letter.\n  I can't help wishing I could send you one,\n  In wishing you herewith a Merry Christmas.\n\n\n\n\nAN OLD MAN'S WINTER NIGHT\n\n\n  All out of doors looked darkly in at him\n  Through the thin frost, almost in separate stars,\n  That gathers on the pane in empty rooms.\n  What kept his eyes from giving back the gaze\n  Was the lamp tilted near them in his hand.\n  What kept him from remembering what it was\n  That brought him to that creaking room was age.\n  He stood with barrels round him--at a loss.\n  And having scared the cellar under him\n  In clomping there, he scared it once again\n  In clomping off;--and scared the outer night,\n  Which has its sounds, familiar, like the roar\n  Of trees and crack of branches, common things,\n  But nothing so like beating on a box.\n  A light he was to no one but himself\n  Where now he sat, concerned with he knew what,\n  A quiet light, and then not even that.\n  He consigned to the moon, such as she was,\n  So late-arising, to the broken moon\n  As better than the sun in any case\n  For such a charge, his snow upon the roof,\n  His icicles along the wall to keep;\n  And slept. The log that shifted with a jolt\n  Once in the stove, disturbed him and he shifted,\n  And eased his heavy breathing, but still slept.\n  One aged man--one man--can't fill a house,\n  A farm, a countryside, or if he can,\n  It's thus he does it of a winter night.\n\n\n\n\nA PATCH OF OLD SNOW\n\n\n  There's a patch of old snow in a corner\n    That I should have guessed\n  Was a blow-away paper the rain\n    Had brought to rest.\n\n  It is speckled with grime as if\n    Small print overspread it,\n  The news of a day I've forgotten--\n    If I ever read it.\n\n\n\n\nIN THE HOME STRETCH\n\n\n  She stood against the kitchen sink, and looked\n  Over the sink out through a dusty window\n  At weeds the water from the sink made tall.\n  She wore her cape; her hat was in her hand.\n  Behind her was confusion in the room,\n  Of chairs turned upside down to sit like people\n  In other chairs, and something, come to look,\n  For every room a house has--parlor, bed-room,\n  And dining-room--thrown pell-mell in the kitchen.\n  And now and then a smudged, infernal face\n  Looked in a door behind her and addressed\n  Her back. She always answered without turning.\n\n  \"Where will I put this walnut bureau, lady?\"\n  \"Put it on top of something that's on top\n  Of something else,\" she laughed. \"Oh, put it where\n  You can to-night, and go. It's almost dark;\n  You must be getting started back to town.\"\n  Another blackened face thrust in and looked\n  And smiled, and when she did not turn, spoke gently,\n  \"What are you seeing out the window, _lady_?\"\n\n  \"Never was I beladied so before.\n  Would evidence of having been called lady\n  More than so many times make me a lady\n  In common law, I wonder.\"\n\n                                                 \"But I ask,\n  What are you seeing out the window, lady?\"\n\n  \"What I'll be seeing more of in the years\n  To come as here I stand and go the round\n  Of many plates with towels many times.\"\n\n  \"And what is that? You only put me off.\"\n\n  \"Rank weeds that love the water from the dish-pan\n  More than some women like the dish-pan, Joe;\n  A little stretch of mowing-field for you;\n  Not much of that until I come to woods\n  That end all. And it's scarce enough to call\n  A view.\"\n\n                      \"And yet you think you like it, dear?\"\n\n  \"That's what you're so concerned to know! You hope\n  I like it. Bang goes something big away\n  Off there upstairs. The very tread of men\n  As great as those is shattering to the frame\n  Of such a little house. Once left alone,\n  You and I, dear, will go with softer steps\n  Up and down stairs and through the rooms, and none\n  But sudden winds that snatch them from our hands\n  Will ever slam the doors.\"\n\n                                            \"I think you see\n  More than you like to own to out that window.\"\n\n  \"No; for besides the things I tell you of,\n  I only see the years. They come and go\n  In alternation with the weeds, the field,\n  The wood.\"\n\n                    \"What kind of years?\"\n                                        \"Why, latter years--\n  Different from early years.\"\n                                           \"I see them, too.\n  You didn't count them?\"\n                                        \"No, the further off\n  So ran together that I didn't try to.\n  It can scarce be that they would be in number\n  We'd care to know, for we are not young now.\n  And bang goes something else away off there.\n  It sounds as if it were the men went down,\n  And every crash meant one less to return\n  To lighted city streets we, too, have known,\n  But now are giving up for country darkness.\"\n\n  \"Come from that window where you see too much for me,\n  And take a livelier view of things from here.\n  They're going. Watch this husky swarming up\n  Over the wheel into the sky-high seat,\n  Lighting his pipe now, squinting down his nose\n  At the flame burning downward as he sucks it.\"\n\n  \"See how it makes his nose-side bright, a proof\n  How dark it's getting. Can you tell what time\n  It is by that? Or by the moon? The new moon!\n  What shoulder did I see her over? Neither.\n  A wire she is of silver, as new as we\n  To everything. Her light won't last us long.\n  It's something, though, to know we're going to have her\n  Night after night and stronger every night\n  To see us through our first two weeks. But, Joe,\n  The stove! Before they go! Knock on the window;\n  Ask them to help you get it on its feet.\n  We stand here dreaming. Hurry! Call them back!\"\n\n  \"They're not gone yet.\"\n\n                               \"We've got to have the stove,\n  Whatever else we want for. And a light.\n  Have we a piece of candle if the lamp\n  And oil are buried out of reach?\"\n                                                       Again\n  The house was full of tramping, and the dark,\n  Door-filling men burst in and seized the stove.\n  A cannon-mouth-like hole was in the wall,\n  To which they set it true by eye; and then\n  Came up the jointed stovepipe in their hands,\n  So much too light and airy for their strength\n  It almost seemed to come ballooning up,\n  Slipping from clumsy clutches toward the ceiling.\n  \"A fit!\" said one, and banged a stovepipe shoulder.\n  \"It's good luck when you move in to begin\n  With good luck with your stovepipe. Never mind,\n  It's not so bad in the country, settled down,\n  When people're getting on in life. You'll like it.\"\n  Joe said: \"You big boys ought to find a farm,\n  And make good farmers, and leave other fellows\n  The city work to do. There's not enough\n  For everybody as it is in there.\"\n  \"God!\" one said wildly, and, when no one spoke:\n  \"Say that to Jimmy here. He needs a farm.\"\n  But Jimmy only made his jaw recede\n  Fool-like, and rolled his eyes as if to say\n  He saw himself a farmer. Then there was a French boy\n  Who said with seriousness that made them laugh,\n  \"Ma friend, you ain't know what it is you're ask.\"\n  He doffed his cap and held it with both hands\n  Across his chest to make as 'twere a bow:\n  \"We're giving you our chances on de farm.\"\n  And then they all turned to with deafening boots\n  And put each other bodily out of the house.\n  \"Goodby to them! We puzzle them. They think--\n  I don't know what they think we see in what\n  They leave us to: that pasture slope that seems\n  The back some farm presents us; and your woods\n  To northward from your window at the sink,\n  Waiting to steal a step on us whenever\n  We drop our eyes or turn to other things,\n  As in the game 'Ten-step' the children play.\"\n\n  \"Good boys they seemed, and let them love the city.\n  All they could say was 'God!' when you proposed\n  Their coming out and making useful farmers.\"\n\n  \"Did they make something lonesome go through you?\n  It would take more than them to sicken you--\n  Us of our bargain. But they left us so\n  As to our fate, like fools past reasoning with.\n  They almost shook _me_.\"\n\n                                           \"It's all so much\n  What we have always wanted, I confess\n  It's seeming bad for a moment makes it seem\n  Even worse still, and so on down, down, down.\n  It's nothing; it's their leaving us at dusk.\n  I never bore it well when people went.\n  The first night after guests have gone, the house\n  Seems haunted or exposed. I always take\n  A personal interest in the locking up\n  At bedtime; but the strangeness soon wears off.\"\n  He fetched a dingy lantern from behind\n  A door. \"There's that we didn't lose! And these!\"--\n  Some matches he unpocketed. \"For food--\n  The meals we've had no one can take from us.\n  I wish that everything on earth were just\n  As certain as the meals we've had. I wish\n  The meals we haven't had were, anyway.\n  What have you you know where to lay your hands on?\"\n\n  \"The bread we bought in passing at the store.\n  There's butter somewhere, too.\"\n\n                                      \"Let's rend the bread.\n  I'll light the fire for company for you;\n  You'll not have any other company\n  Till Ed begins to get out on a Sunday\n  To look us over and give us his idea\n  Of what wants pruning, shingling, breaking up.\n  He'll know what he would do if he were we,\n  And all at once. He'll plan for us and plan\n  To help us, but he'll take it out in planning.\n  Well, you can set the table with the loaf.\n  Let's see you find your loaf. I'll light the fire.\n  I like chairs occupying other chairs\n  Not offering a lady--\"\n\n                                          \"There again, Joe!\n  _You're tired._\"\n\n                           \"I'm drunk-nonsensical tired out;\n  Don't mind a word I say. It's a day's work\n  To empty one house of all household goods\n  And fill another with 'em fifteen miles away,\n  Although you do no more than dump them down.\"\n\n  \"Dumped down in paradise we are and happy.\"\n\n  \"It's all so much what I have always wanted,\n  I can't believe it's what you wanted, too.\"\n\n  \"Shouldn't you like to know?\"\n\n                                           \"I'd like to know\n  If it is what you wanted, then how much\n  You wanted it for me.\"\n\n                                     \"A troubled conscience!\n  You don't want me to tell if _I_ don't know.\"\n\n  \"I don't want to find out what can't be known.\n\n  But who first said the word to come?\"\n\n                                                   \"My dear,\n  It's who first thought the thought. You're searching, Joe,\n  For things that don't exist; I mean beginnings.\n  Ends and beginnings--there are no such things.\n  There are only middles.\"\n\n                            \"What is this?\"\n                                                 \"This life?\n  Our sitting here by lantern-light together\n  Amid the wreckage of a former home?\n  You won't deny the lantern isn't new.\n  The stove is not, and you are not to me,\n  Nor I to you.\"\n\n                                   \"Perhaps you never were?\"\n\n  \"It would take me forever to recite\n  All that's not new in where we find ourselves.\n  New is a word for fools in towns who think\n  Style upon style in dress and thought at last\n  Must get somewhere. I've heard you say as much.\n  No, this is no beginning.\"\n\n                                              \"Then an end?\"\n  \"End is a gloomy word.\"\n\n                                             \"Is it too late\n  To drag you out for just a good-night call\n  On the old peach trees on the knoll to grope\n  By starlight in the grass for a last peach\n  The neighbors may not have taken as their right\n  When the house wasn't lived in? I've been looking:\n  I doubt if they have left us many grapes.\n  Before we set ourselves to right the house,\n  The first thing in the morning, out we go\n  To go the round of apple, cherry, peach,\n  Pine, alder, pasture, mowing, well, and brook.\n  All of a farm it is.\"\n\n                                          \"I know this much:\n  I'm going to put you in your bed, if first\n  I have to make you build it. Come, the light.\"\n\n  When there was no more lantern in the kitchen,\n  The fire got out through crannies in the stove\n  And danced in yellow wrigglers on the ceiling,\n  As much at home as if they'd always danced there.\n\n\n\n\nTHE TELEPHONE\n\n\n  \"When I was just as far as I could walk\n  From here to-day,\n  There was an hour\n  All still\n  When leaning with my head against a flower\n  I heard you talk.\n  Don't say I didn't, for I heard you say--\n  You spoke from that flower on the window sill--\n  Do you remember what it was you said?\"\n\n  \"First tell me what it was you thought you heard.\"\n\n  \"Having found the flower and driven a bee away,\n  I leaned my head,\n  And holding by the stalk,\n  I listened and I thought I caught the word--\n  What was it? Did you call me by my name?\n  Or did you say--\n  _Someone_ said 'Come'--I heard it as I bowed.\"\n\n  \"I may have thought as much, but not aloud.\"\n\n  \"Well, so I came.\"\n\n\n\n\nMEETING AND PASSING\n\n\n  As I went down the hill along the wall\n  There was a gate I had leaned at for the view\n  And had just turned from when I first saw you\n  As you came up the hill. We met. But all\n  We did that day was mingle great and small\n  Footprints in summer dust as if we drew\n  The figure of our being less than two\n  But more than one as yet. Your parasol\n\n  Pointed the decimal off with one deep thrust.\n  And all the time we talked you seemed to see\n  Something down there to smile at in the dust.\n  (Oh, it was without prejudice to me!)\n  Afterward I went past what you had passed\n  Before we met and you what I had passed.\n\n\n\n\nHYLA BROOK\n\n\n  By June our brook's run out of song and speed.\n  Sought for much after that, it will be found\n  Either to have gone groping underground\n  (And taken with it all the Hyla breed\n  That shouted in the mist a month ago,\n  Like ghost of sleigh-bells in a ghost of snow)--\n  Or flourished and come up in jewel-weed,\n  Weak foliage that is blown upon and bent\n  Even against the way its waters went.\n  Its bed is left a faded paper sheet\n  Of dead leaves stuck together by the heat--\n  A brook to none but who remember long.\n  This as it will be seen is other far\n  Than with brooks taken otherwhere in song.\n  We love the things we love for what they are.\n\n\n\n\nTHE OVEN BIRD\n\n\n  There is a singer everyone has heard,\n  Loud, a mid-summer and a mid-wood bird,\n  Who makes the solid tree trunks sound again.\n  He says that leaves are old and that for flowers\n  Mid-summer is to spring as one to ten.\n  He says the early petal-fall is past\n  When pear and cherry bloom went down in showers\n  On sunny days a moment overcast;\n  And comes that other fall we name the fall.\n  He says the highway dust is over all.\n  The bird would cease and be as other birds\n  But that he knows in singing not to sing.\n  The question that he frames in all but words\n  Is what to make of a diminished thing.\n\n\n\n\nBOND AND FREE\n\n\n  Love has earth to which she clings\n  With hills and circling arms about--\n  Wall within wall to shut fear out.\n  But Thought has need of no such things,\n  For Thought has a pair of dauntless wings.\n\n  On snow and sand and turf, I see\n  Where Love has left a printed trace\n  With straining in the world's embrace.\n  And such is Love and glad to be.\n  But Thought has shaken his ankles free.\n\n  Thought cleaves the interstellar gloom\n  And sits in Sirius' disc all night,\n  Till day makes him retrace his flight,\n  With smell of burning on every plume,\n  Back past the sun to an earthly room.\n\n  His gains in heaven are what they are.\n  Yet some say Love by being thrall\n  And simply staying possesses all\n  In several beauty that Thought fares far\n  To find fused in another star.\n\n\n\n\nBIRCHES\n\n\n  When I see birches bend to left and right\n  Across the lines of straighter darker trees,\n  I like to think some boy's been swinging them.\n  But swinging doesn't bend them down to stay.\n  Ice-storms do that. Often you must have seen them\n  Loaded with ice a sunny winter morning\n  After a rain. They click upon themselves\n  As the breeze rises, and turn many-colored\n  As the stir cracks and crazes their enamel.\n  Soon the sun's warmth makes them shed crystal shells\n  Shattering and avalanching on the snow-crust--\n  Such heaps of broken glass to sweep away\n  You'd think the inner dome of heaven had fallen.\n  They are dragged to the withered bracken by the load,\n  And they seem not to break; though once they are bowed\n  So low for long, they never right themselves:\n  You may see their trunks arching in the woods\n  Years afterwards, trailing their leaves on the ground\n  Like girls on hands and knees that throw their hair\n  Before them over their heads to dry in the sun.\n  But I was going to say when Truth broke in\n  With all her matter-of-fact about the ice-storm\n  (Now am I free to be poetical?)\n  I should prefer to have some boy bend them\n  As he went out and in to fetch the cows--\n  Some boy too far from town to learn baseball,\n  Whose only play was what he found himself,\n  Summer or winter, and could play alone.\n  One by one he subdued his father's trees\n  By riding them down over and over again\n  Until he took the stiffness out of them,\n  And not one but hung limp, not one was left\n  For him to conquer. He learned all there was\n  To learn about not launching out too soon\n  And so not carrying the tree away\n  Clear to the ground. He always kept his poise\n  To the top branches, climbing carefully\n  With the same pains you use to fill a cup\n  Up to the brim, and even above the brim.\n  Then he flung outward, feet first, with a swish,\n  Kicking his way down through the air to the ground.\n  So was I once myself a swinger of birches.\n  And so I dream of going back to be.\n  It's when I'm weary of considerations,\n  And life is too much like a pathless wood\n  Where your face burns and tickles with the cobwebs\n  Broken across it, and one eye is weeping\n  From a twig's having lashed across it open.\n  I'd like to get away from earth awhile\n  And then come back to it and begin over.\n  May no fate willfully misunderstand me\n  And half grant what I wish and snatch me away\n  Not to return. Earth's the right place for love:\n  I don't know where it's likely to go better.\n  I'd like to go by climbing a birch tree,\n  And climb black branches up a snow-white trunk\n  _Toward_ heaven, till the tree could bear no more,\n  But dipped its top and set me down again.\n  That would be good both going and coming back.\n  One could do worse than be a swinger of birches.\n\n\n\n\nPEA BRUSH\n\n\n  I walked down alone Sunday after church\n    To the place where John has been cutting trees\n  To see for myself about the birch\n    He said I could have to bush my peas.\n\n  The sun in the new-cut narrow gap\n    Was hot enough for the first of May,\n  And stifling hot with the odor of sap\n    From stumps still bleeding their life away.\n\n  The frogs that were peeping a thousand shrill\n    Wherever the ground was low and wet,\n  The minute they heard my step went still\n    To watch me and see what I came to get.\n\n  Birch boughs enough piled everywhere!--\n    All fresh and sound from the recent axe.\n  Time someone came with cart and pair\n    And got them off the wild flower's backs.\n\n  They might be good for garden things\n    To curl a little finger round,\n  The same as you seize cat's-cradle strings,\n    And lift themselves up off the ground.\n\n  Small good to anything growing wild,\n    They were crooking many a trillium\n  That had budded before the boughs were piled\n    And since it was coming up had to come.\n\n\n\n\nPUTTING IN THE SEED\n\n\n  You come to fetch me from my work to-night\n  When supper's on the table, and we'll see\n  If I can leave off burying the white\n  Soft petals fallen from the apple tree.\n  (Soft petals, yes, but not so barren quite,\n  Mingled with these, smooth bean and wrinkled pea;)\n  And go along with you ere you lose sight\n  Of what you came for and become like me,\n  Slave to a springtime passion for the earth.\n  How Love burns through the Putting in the Seed\n  On through the watching for that early birth\n  When, just as the soil tarnishes with weed,\n\n  The sturdy seedling with arched body comes\n  Shouldering its way and shedding the earth crumbs.\n\n\n\n\nA TIME TO TALK\n\n\n  When a friend calls to me from the road\n  And slows his horse to a meaning walk,\n  I don't stand still and look around\n  On all the hills I haven't hoed,\n  And shout from where I am, What is it?\n  No, not as there is a time to talk.\n  I thrust my hoe in the mellow ground,\n  Blade-end up and five feet tall,\n  And plod: I go up to the stone wall\n  For a friendly visit.\n\n\n\n\nTHE COW IN APPLE TIME\n\n\n  Something inspires the only cow of late\n  To make no more of a wall than an open gate,\n  And think no more of wall-builders than fools.\n  Her face is flecked with pomace and she drools\n  A cider syrup. Having tasted fruit,\n  She scorns a pasture withering to the root.\n  She runs from tree to tree where lie and sweeten\n  The windfalls spiked with stubble and worm-eaten.\n  She leaves them bitten when she has to fly.\n  She bellows on a knoll against the sky.\n  Her udder shrivels and the milk goes dry.\n\n\n\n\nAN ENCOUNTER\n\n\n  Once on the kind of day called \"weather breeder,\"\n  When the heat slowly hazes and the sun\n  By its own power seems to be undone,\n  I was half boring through, half climbing through\n  A swamp of cedar. Choked with oil of cedar\n  And scurf of plants, and weary and over-heated,\n  And sorry I ever left the road I knew,\n  I paused and rested on a sort of hook\n  That had me by the coat as good as seated,\n  And since there was no other way to look,\n  Looked up toward heaven, and there against the blue,\n  Stood over me a resurrected tree,\n  A tree that had been down and raised again--\n  A barkless spectre. He had halted too,\n  As if for fear of treading upon me.\n  I saw the strange position of his hands--\n  Up at his shoulders, dragging yellow strands\n  Of wire with something in it from men to men.\n  \"You here?\" I said. \"Where aren't you nowadays\n  And what's the news you carry--if you know?\n  And tell me where you're off for--Montreal?\n  Me? I'm not off for anywhere at all.\n  Sometimes I wander out of beaten ways\n  Half looking for the orchid Calypso.\"\n\n\n\n\nRANGE-FINDING\n\n\n  The battle rent a cobweb diamond-strung\n  And cut a flower beside a ground bird's nest\n  Before it stained a single human breast.\n  The stricken flower bent double and so hung.\n  And still the bird revisited her young.\n  A butterfly its fall had dispossessed\n  A moment sought in air his flower of rest,\n  Then lightly stooped to it and fluttering clung.\n\n  On the bare upland pasture there had spread\n  O'ernight 'twixt mullein stalks a wheel of thread\n  And straining cables wet with silver dew.\n  A sudden passing bullet shook it dry.\n  The indwelling spider ran to greet the fly,\n  But finding nothing, sullenly withdrew.\n\n\n\n\nTHE HILL WIFE\n\n\nLONELINESS\n\n(_Her Word_)\n\n  One ought not to have to care\n    So much as you and I\n  Care when the birds come round the house\n    To seem to say good-bye;\n\n  Or care so much when they come back\n    With whatever it is they sing;\n  The truth being we are as much\n    Too glad for the one thing\n\n  As we are too sad for the other here--\n    With birds that fill their breasts\n  But with each other and themselves\n    And their built or driven nests.\n\n\nHOUSE FEAR\n\n  Always--I tell you this they learned--\n  Always at night when they returned\n  To the lonely house from far away\n  To lamps unlighted and fire gone gray,\n  They learned to rattle the lock and key\n  To give whatever might chance to be\n  Warning and time to be off in flight:\n  And preferring the out- to the in-door night,\n  They learned to leave the house-door wide\n  Until they had lit the lamp inside.\n\n\nTHE SMILE\n\n(_Her Word_)\n\n  I didn't like the way he went away.\n  That smile! It never came of being gay.\n  Still he smiled--did you see him?--I was sure!\n  Perhaps because we gave him only bread\n  And the wretch knew from that that we were poor.\n  Perhaps because he let us give instead\n  Of seizing from us as he might have seized.\n  Perhaps he mocked at us for being wed,\n  Or being very young (and he was pleased\n  To have a vision of us old and dead).\n  I wonder how far down the road he's got.\n  He's watching from the woods as like as not.\n\n\nTHE OFT-REPEATED DREAM\n\n  She had no saying dark enough\n    For the dark pine that kept\n  Forever trying the window-latch\n    Of the room where they slept.\n\n  The tireless but ineffectual hands\n    That with every futile pass\n  Made the great tree seem as a little bird\n    Before the mystery of glass!\n\n  It never had been inside the room,\n    And only one of the two\n  Was afraid in an oft-repeated dream\n    Of what the tree might do.\n\n\nTHE IMPULSE\n\n  It was too lonely for her there,\n    And too wild,\n  And since there were but two of them,\n    And no child,\n\n  And work was little in the house,\n    She was free,\n  And followed where he furrowed field,\n    Or felled tree.\n\n  She rested on a log and tossed\n    The fresh chips,\n  With a song only to herself\n    On her lips.\n\n  And once she went to break a bough\n    Of black alder.\n  She strayed so far she scarcely heard\n    When he called her--\n\n  And didn't answer--didn't speak--\n    Or return.\n  She stood, and then she ran and hid\n    In the fern.\n\n  He never found her, though he looked\n    Everywhere,\n  And he asked at her mother's house\n    Was she there.\n\n  Sudden and swift and light as that\n    The ties gave,\n  And he learned of finalities\n    Besides the grave.\n\n\n\n\nTHE BONFIRE\n\n\n  \"Oh, let's go up the hill and scare ourselves,\n  As reckless as the best of them to-night,\n  By setting fire to all the brush we piled\n  With pitchy hands to wait for rain or snow.\n  Oh, let's not wait for rain to make it safe.\n  The pile is ours: we dragged it bough on bough\n  Down dark converging paths between the pines.\n  Let's not care what we do with it to-night.\n  Divide it? No! But burn it as one pile\n  The way we piled it. And let's be the talk\n  Of people brought to windows by a light\n  Thrown from somewhere against their wall-paper.\n  Rouse them all, both the free and not so free\n  With saying what they'd like to do to us\n  For what they'd better wait till we have done.\n  Let's all but bring to life this old volcano,\n  If that is what the mountain ever was--\n  And scare ourselves. Let wild fire loose we will....\"\n\n  \"And scare you too?\" the children said together.\n\n  \"Why wouldn't it scare me to have a fire\n  Begin in smudge with ropy smoke and know\n  That still, if I repent, I may recall it,\n  But in a moment not: a little spurt\n  Of burning fatness, and then nothing but\n  The fire itself can put it out, and that\n  By burning out, and before it burns out\n  It will have roared first and mixed sparks with stars,\n  And sweeping round it with a flaming sword,\n  Made the dim trees stand back in wider circle--\n  Done so much and I know not how much more\n  I mean it shall not do if I can bind it.\n  Well if it doesn't with its draft bring on\n  A wind to blow in earnest from some quarter,\n  As once it did with me upon an April.\n  The breezes were so spent with winter blowing\n  They seemed to fail the bluebirds under them\n  Short of the perch their languid flight was toward;\n  And my flame made a pinnacle to heaven\n  As I walked once round it in possession.\n  But the wind out of doors--you know the saying.\n  There came a gust. You used to think the trees\n  Made wind by fanning since you never knew\n  It blow but that you saw the trees in motion.\n  Something or someone watching made that gust.\n  It put the flame tip-down and dabbed the grass\n  Of over-winter with the least tip-touch\n  Your tongue gives salt or sugar in your hand.\n  The place it reached to blackened instantly.\n  The black was all there was by day-light,\n  That and the merest curl of cigarette smoke--\n  And a flame slender as the hepaticas,\n  Blood-root, and violets so soon to be now.\n  But the black spread like black death on the ground,\n  And I think the sky darkened with a cloud\n  Like winter and evening coming on together.\n  There were enough things to be thought of then.\n  Where the field stretches toward the north\n  And setting sun to Hyla brook, I gave it\n  To flames without twice thinking, where it verges\n  Upon the road, to flames too, though in fear\n  They might find fuel there, in withered brake,\n  Grass its full length, old silver golden-rod,\n  And alder and grape vine entanglement,\n  To leap the dusty deadline. For my own\n  I took what front there was beside. I knelt\n  And thrust hands in and held my face away.\n  Fight such a fire by rubbing not by beating.\n  A board is the best weapon if you have it.\n  I had my coat. And oh, I knew, I knew,\n  And said out loud, I couldn't bide the smother\n  And heat so close in; but the thought of all\n  The woods and town on fire by me, and all\n  The town turned out to fight for me--that held me.\n  I trusted the brook barrier, but feared\n  The road would fail; and on that side the fire\n  Died not without a noise of crackling wood--\n  Of something more than tinder-grass and weed--\n  That brought me to my feet to hold it back\n  By leaning back myself, as if the reins\n  Were round my neck and I was at the plough.\n  I won! But I'm sure no one ever spread\n  Another color over a tenth the space\n  That I spread coal-black over in the time\n  It took me. Neighbors coming home from town\n  Couldn't believe that so much black had come there\n  While they had backs turned, that it hadn't been there\n  When they had passed an hour or so before\n  Going the other way and they not seen it.\n  They looked about for someone to have done it.\n  But there was no one. I was somewhere wondering\n  Where all my weariness had gone and why\n  I walked so light on air in heavy shoes\n  In spite of a scorched Fourth-of-July feeling.\n  Why wouldn't I be scared remembering that?\"\n\n  \"If it scares you, what will it do to us?\"\n\n  \"Scare you. But if you shrink from being scared,\n  What would you say to war if it should come?\n  That's what for reasons I should like to know--\n  If you can comfort me by any answer.\"\n\n  \"Oh, but war's not for children--it's for men.\"\n\n  \"Now we are digging almost down to China.\n  My dears, my dears, you thought that--we all thought it.\n  So your mistake was ours. Haven't you heard, though,\n  About the ships where war has found them out\n  At sea, about the towns where war has come\n  Through opening clouds at night with droning speed\n  Further o'erhead than all but stars and angels,--\n  And children in the ships and in the towns?\n  Haven't you heard what we have lived to learn?\n  Nothing so new--something we had forgotten:\n  _War is for everyone, for children too_.\n  I wasn't going to tell you and I mustn't.\n  The best way is to come up hill with me\n  And have our fire and laugh and be afraid.\"\n\n\n\n\nA GIRL'S GARDEN\n\n\n  A neighbor of mine in the village\n    Likes to tell how one spring\n  When she was a girl on the farm, she did\n    A childlike thing.\n\n  One day she asked her father\n    To give her a garden plot\n  To plant and tend and reap herself,\n    And he said, \"Why not?\"\n\n  In casting about for a corner\n    He thought of an idle bit\n  Of walled-off ground where a shop had stood,\n    And he said, \"Just it.\"\n\n  And he said, \"That ought to make you\n    An ideal one-girl farm,\n  And give you a chance to put some strength\n    On your slim-jim arm.\"\n\n  It was not enough of a garden,\n    Her father said, to plough;\n  So she had to work it all by hand,\n    But she don't mind now.\n\n  She wheeled the dung in the wheelbarrow\n    Along a stretch of road;\n  But she always ran away and left\n    Her not-nice load.\n\n  And hid from anyone passing.\n    And then she begged the seed.\n  She says she thinks she planted one\n    Of all things but weed.\n\n  A hill each of potatoes,\n    Radishes, lettuce, peas,\n  Tomatoes, beets, beans, pumpkins, corn,\n    And even fruit trees.\n\n  And yes, she has long mistrusted\n    That a cider apple tree\n  In bearing there to-day is hers,\n    Or at least may be.\n\n  Her crop was a miscellany\n    When all was said and done,\n  A little bit of everything,\n    A great deal of none.\n\n  _Now_ when she sees in the village\n    How village things go,\n  Just when it seems to come in right,\n    She says, \"_I_ know!\n\n  It's as when I was a farmer----\"\n    Oh, never by way of advice!\n  And she never sins by telling the tale\n    To the same person twice.\n\n\n\n\nTHE EXPOSED NEST\n\n\n  You were forever finding some new play.\n  So when I saw you down on hands and knees\n  In the meadow, busy with the new-cut hay,\n  Trying, I thought, to set it up on end,\n  I went to show you how to make it stay,\n  If that was your idea, against the breeze,\n  And, if you asked me, even help pretend\n  To make it root again and grow afresh.\n  But 'twas no make-believe with you to-day,\n  Nor was the grass itself your real concern,\n  Though I found your hand full of wilted fern,\n  Steel-bright June-grass, and blackening heads of clover.\n  'Twas a nest full of young birds on the ground\n  The cutter-bar had just gone champing over\n  (Miraculously without tasting flesh)\n  And left defenseless to the heat and light.\n  You wanted to restore them to their right\n  Of something interposed between their sight\n  And too much world at once--could means be found.\n  The way the nest-full every time we stirred\n  Stood up to us as to a mother-bird\n  Whose coming home has been too long deferred,\n  Made me ask would the mother-bird return\n  And care for them in such a change of scene\n  And might our meddling make her more afraid.\n  That was a thing we could not wait to learn.\n  We saw the risk we took in doing good,\n  But dared not spare to do the best we could\n  Though harm should come of it; so built the screen\n  You had begun, and gave them back their shade.\n  All this to prove we cared. Why is there then\n  No more to tell? We turned to other things.\n  I haven't any memory--have you?--\n  Of ever coming to the place again\n  To see if the birds lived the first night through,\n  And so at last to learn to use their wings.\n\n\n\n\n\"OUT, OUT--\"\n\n\n  The buzz-saw snarled and rattled in the yard\n  And made dust and dropped stove-length sticks of wood,\n  Sweet-scented stuff when the breeze drew across it.\n  And from there those that lifted eyes could count\n  Five mountain ranges one behind the other\n  Under the sunset far into Vermont.\n  And the saw snarled and rattled, snarled and rattled,\n  As it ran light, or had to bear a load.\n  And nothing happened: day was all but done.\n  Call it a day, I wish they might have said\n  To please the boy by giving him the half hour\n  That a boy counts so much when saved from work.\n  His sister stood beside them in her apron\n  To tell them \"Supper.\" At the word, the saw,\n  As if to prove saws knew what supper meant,\n  Leaped out at the boy's hand, or seemed to leap--\n  He must have given the hand. However it was,\n  Neither refused the meeting. But the hand!\n  The boy's first outcry was a rueful laugh,\n  As he swung toward them holding up the hand\n  Half in appeal, but half as if to keep\n  The life from spilling. Then the boy saw all--\n  Since he was old enough to know, big boy\n  Doing a man's work, though a child at heart--\n  He saw all spoiled. \"Don't let him cut my hand off--\n  The doctor, when he comes. Don't let him, sister!\"\n  So. But the hand was gone already.\n  The doctor put him in the dark of ether.\n  He lay and puffed his lips out with his breath.\n  And then--the watcher at his pulse took fright.\n  No one believed. They listened at his heart.\n  Little--less--nothing!--and that ended it.\n  No more to build on there. And they, since they\n  Were not the one dead, turned to their affairs.\n\n\n\n\nBROWN'S DESCENT\n\nOR\n\nTHE WILLY-NILLY SLIDE\n\n\n  Brown lived at such a lofty farm\n    That everyone for miles could see\n  His lantern when he did his chores\n    In winter after half-past three.\n\n  And many must have seen him make\n    His wild descent from there one night,\n  'Cross lots, 'cross walls, 'cross everything,\n    Describing rings of lantern light.\n\n  Between the house and barn the gale\n    Got him by something he had on\n  And blew him out on the icy crust\n    That cased the world, and he was gone!\n\n  Walls were all buried, trees were few:\n    He saw no stay unless he stove\n  A hole in somewhere with his heel.\n    But though repeatedly he strove\n\n  And stamped and said things to himself,\n    And sometimes something seemed to yield,\n  He gained no foothold, but pursued\n    His journey down from field to field.\n\n  Sometimes he came with arms outspread\n    Like wings, revolving in the scene\n  Upon his longer axis, and\n    With no small dignity of mien.\n\n  Faster or slower as he chanced,\n    Sitting or standing as he chose,\n  According as he feared to risk\n    His neck, or thought to spare his clothes,\n\n  He never let the lantern drop.\n    And some exclaimed who saw afar\n  The figures he described with it,\n    \"I wonder what those signals are\n\n  Brown makes at such an hour of night!\n    He's celebrating something strange.\n  I wonder if he's sold his farm,\n    Or been made Master of the Grange.\"\n\n  He reeled, he lurched, he bobbed, he checked;\n    He fell and made the lantern rattle\n  (But saved the light from going out.)\n    So half-way down he fought the battle\n\n  Incredulous of his own bad luck.\n    And then becoming reconciled\n  To everything, he gave it up\n    And came down like a coasting child.\n\n  \"Well--I--be--\" that was all he said,\n    As standing in the river road,\n  He looked back up the slippery slope\n    (Two miles it was) to his abode.\n\n  Sometimes as an authority\n    On motor-cars, I'm asked if I\n  Should say our stock was petered out,\n    And this is my sincere reply:\n\n  Yankees are what they always were.\n    Don't think Brown ever gave up hope\n  Of getting home again because\n    He couldn't climb that slippery slope;\n\n  Or even thought of standing there\n    Until the January thaw\n  Should take the polish off the crust.\n    He bowed with grace to natural law,\n\n  And then went round it on his feet,\n    After the manner of our stock;\n  Not much concerned for those to whom,\n    At that particular time o'clock,\n\n  It must have looked as if the course\n    He steered was really straight away\n  From that which he was headed for--\n    Not much concerned for them, I say;\n\n  No more so than became a man--\n    _And_ politician at odd seasons.\n  I've kept Brown standing in the cold\n    While I invested him with reasons;\n\n  But now he snapped his eyes three times;\n    Then shook his lantern, saying, \"Ile's\n  'Bout out!\" and took the long way home\n    By road, a matter of several miles.\n\n\n\n\nTHE GUM-GATHERER\n\n\n  There overtook me and drew me in\n  To his down-hill, early-morning stride,\n  And set me five miles on my road\n  Better than if he had had me ride,\n  A man with a swinging bag for load\n  And half the bag wound round his hand.\n  We talked like barking above the din\n  Of water we walked along beside.\n  And for my telling him where I'd been\n  And where I lived in mountain land\n  To be coming home the way I was,\n  He told me a little about himself.\n  He came from higher up in the pass\n  Where the grist of the new-beginning brooks\n  Is blocks split off the mountain mass--\n  And hopeless grist enough it looks\n  Ever to grind to soil for grass.\n  (The way it is will do for moss.)\n  There he had built his stolen shack.\n  It had to be a stolen shack\n  Because of the fears of fire and loss\n  That trouble the sleep of lumber folk:\n  Visions of half the world burned black\n  And the sun shrunken yellow in smoke.\n  We know who when they come to town\n  Bring berries under the wagon seat,\n  Or a basket of eggs between their feet;\n  What this man brought in a cotton sack\n  Was gum, the gum of the mountain spruce.\n  He showed me lumps of the scented stuff\n  Like uncut jewels, dull and rough.\n  It comes to market golden brown;\n  But turns to pink between the teeth.\n\n  I told him this is a pleasant life\n  To set your breast to the bark of trees\n  That all your days are dim beneath,\n  And reaching up with a little knife,\n  To loose the resin and take it down\n  And bring it to market when you please.\n\n\n\n\nTHE LINE-GANG\n\n\n  Here come the line-gang pioneering by.\n  They throw a forest down less cut than broken.\n  They plant dead trees for living, and the dead\n  They string together with a living thread.\n  They string an instrument against the sky\n  Wherein words whether beaten out or spoken\n  Will run as hushed as when they were a thought.\n  But in no hush they string it: they go past\n  With shouts afar to pull the cable taut,\n  To hold it hard until they make it fast,\n  To ease away--they have it. With a laugh,\n  An oath of towns that set the wild at naught\n  They bring the telephone and telegraph.\n\n\n\n\nTHE VANISHING RED\n\n\n  He is said to have been the last Red Man\n  In Acton. And the Miller is said to have laughed--\n  If you like to call such a sound a laugh.\n  But he gave no one else a laugher's license.\n  For he turned suddenly grave as if to say,\n  \"Whose business,--if I take it on myself,\n  Whose business--but why talk round the barn?--\n  When it's just that I hold with getting a thing done with.\"\n  You can't get back and see it as he saw it.\n  It's too long a story to go into now.\n  You'd have to have been there and lived it.\n  Then you wouldn't have looked on it as just a matter\n  Of who began it between the two races.\n\n  Some guttural exclamation of surprise\n  The Red Man gave in poking about the mill\n  Over the great big thumping shuffling mill-stone\n  Disgusted the Miller physically as coming\n  From one who had no right to be heard from.\n  \"Come, John,\" he said, \"you want to see the wheel pit?\"\n\n  He took him down below a cramping rafter,\n  And showed him, through a manhole in the floor,\n  The water in desperate straits like frantic fish,\n  Salmon and sturgeon, lashing with their tails.\n  Then he shut down the trap door with a ring in it\n  That jangled even above the general noise,\n  And came up stairs alone--and gave that laugh,\n  And said something to a man with a meal-sack\n  That the man with the meal-sack didn't catch--then.\n  Oh, yes, he showed John the wheel pit all right.\n\n\n\n\nSNOW\n\n\n  The three stood listening to a fresh access\n  Of wind that caught against the house a moment,\n  Gulped snow, and then blew free again--the Coles\n  Dressed, but dishevelled from some hours of sleep,\n  Meserve belittled in the great skin coat he wore.\n\n  Meserve was first to speak. He pointed backward\n  Over his shoulder with his pipe-stem, saying,\n  \"You can just see it glancing off the roof\n  Making a great scroll upward toward the sky,\n  Long enough for recording all our names on.--\n  I think I'll just call up my wife and tell her\n  I'm here--so far--and starting on again.\n  I'll call her softly so that if she's wise\n  And gone to sleep, she needn't wake to answer.\"\n  Three times he barely stirred the bell, then listened.\n  \"Why, Lett, still up? Lett, I'm at Cole's. I'm late.\n  I called you up to say Good-night from here\n  Before I went to say Good-morning there.--\n  I thought I would.--I know, but, Lett--I know--\n  I could, but what's the sense? The rest won't be\n  So bad.--Give me an hour for it.--Ho, ho,\n  Three hours to here! But that was all up hill;\n  The rest is down.--Why no, no, not a wallow:\n  They kept their heads and took their time to it\n  Like darlings, both of them. They're in the barn.--\n  My dear, I'm coming just the same. I didn't\n  Call you to ask you to invite me home.--\"\n  He lingered for some word she wouldn't say,\n  Said it at last himself, \"Good-night,\" and then,\n  Getting no answer, closed the telephone.\n  The three stood in the lamplight round the table\n  With lowered eyes a moment till he said,\n  \"I'll just see how the horses are.\"\n\n                                                    \"Yes, do,\"\n  Both the Coles said together. Mrs. Cole\n  Added: \"You can judge better after seeing.--\n  I want you here with me, Fred. Leave him here,\n  Brother Meserve. You know to find your way\n  Out through the shed.\"\n\n                                       \"I guess I know my way,\n  I guess I know where I can find my name\n  Carved in the shed to tell me who I am\n  If it don't tell me where I am. I used\n  To play--\"\n\n                          \"You tend your horses and come back.\n  Fred Cole, you're going to let him!\"\n\n                                            \"Well, aren't you?\n  How can you help yourself?\"\n\n                                        \"I called him Brother.\n  Why did I call him that?\"\n\n                                           \"It's right enough.\n  That's all you ever heard him called round here.\n  He seems to have lost off his Christian name.\"\n\n  \"Christian enough I should call that myself.\n  He took no notice, did he? Well, at least\n  I didn't use it out of love of him,\n  The dear knows. I detest the thought of him\n  With his ten children under ten years old.\n  I hate his wretched little Racker Sect,\n  All's ever I heard of it, which isn't much.\n  But that's not saying--Look, Fred Cole, it's twelve,\n  Isn't it, now? He's been here half an hour.\n  He says he left the village store at nine.\n  Three hours to do four miles--a mile an hour\n  Or not much better. Why, it doesn't seem\n  As if a man could move that slow and move.\n  Try to think what he did with all that time.\n  And three miles more to go!\"\n\n                                            \"Don't let him go.\n  Stick to him, Helen. Make him answer you.\n  That sort of man talks straight on all his life\n  From the last thing he said himself, stone deaf\n  To anything anyone else may say.\n  I should have thought, though, you could make him hear you.\"\n\n  \"What is he doing out a night like this?\n  Why can't he stay at home?\"\n\n                                           \"He had to preach.\"\n\n  \"It's no night to be out.\"\n\n                                             \"He may be small,\n  He may be good, but one thing's sure, he's tough.\"\n\n  \"And strong of stale tobacco.\"\n\n                                         \"He'll pull through.\"\n\n  \"You only say so. Not another house\n  Or shelter to put into from this place\n  To theirs. I'm going to call his wife again.\"\n\n  \"Wait and he may. Let's see what he will do.\n  Let's see if he will think of her again.\n  But then I doubt he's thinking of himself\n  He doesn't look on it as anything.\"\n\n  \"He shan't go--there!\"\n\n                                   \"It _is_ a night, my dear.\"\n\n  \"One thing: he didn't drag God into it.\"\n\n  \"He don't consider it a case for God.\"\n\n  \"You think so, do you? You don't know the kind.\n  He's getting up a miracle this minute.\n  Privately--to himself, right now, he's thinking\n  He'll make a case of it if he succeeds,\n  But keep still if he fails.\"\n\n                                         \"Keep still all over.\n  He'll be dead--dead and buried.\"\n\n                                              \"Such a trouble!\n  Not but I've every reason not to care\n  What happens to him if it only takes\n  Some of the sanctimonious conceit\n  Out of one of those pious scalawags.\"\n\n  \"Nonsense to that! You want to see him safe.\"\n\n  \"You like the runt.\"\n\n                                         \"Don't you a little?\"\n\n                                                        \"Well,\n  I don't like what he's doing, which is what\n  You like, and like him for.\"\n\n                                              \"Oh, yes you do.\n  You like your fun as well as anyone;\n  Only you women have to put these airs on\n  To impress men. You've got us so ashamed\n  Of being men we can't look at a good fight\n  Between two boys and not feel bound to stop it.\n  Let the man freeze an ear or two, I say.--\n  He's here. I leave him all to you. Go in\n  And save his life.--All right, come in, Meserve.\n  Sit down, sit down. How did you find the horses?\"\n\n  \"Fine, fine.\"\n\n                        \"And ready for some more? My wife here\n  Says it won't do. You've got to give it up.\"\n\n  \"Won't you to please me? Please! If I say please?\n  Mr. Meserve, I'll leave it to _your_ wife.\n  What _did_ your wife say on the telephone?\"\n\n  Meserve seemed to heed nothing but the lamp\n  Or something not far from it on the table.\n  By straightening out and lifting a forefinger,\n  He pointed with his hand from where it lay\n  Like a white crumpled spider on his knee:\n  \"That leaf there in your open book! It moved\n  Just then, I thought. It's stood erect like that,\n  There on the table, ever since I came,\n  Trying to turn itself backward or forward,\n  I've had my eye on it to make out which;\n  If forward, then it's with a friend's impatience--\n  You see I know--to get you on to things\n  It wants to see how you will take, if backward\n  It's from regret for something you have passed\n  And failed to see the good of. Never mind,\n  Things must expect to come in front of us\n  A many times--I don't say just how many--\n  That varies with the things--before we see them.\n  One of the lies would make it out that nothing\n  Ever presents itself before us twice.\n  Where would we be at last if that were so?\n  Our very life depends on everything's\n  Recurring till we answer from within.\n  The thousandth time may prove the charm.--That leaf!\n  It can't turn either way. It needs the wind's help.\n  But the wind didn't move it if it moved.\n  It moved itself. The wind's at naught in here.\n  It couldn't stir so sensitively poised\n  A thing as that. It couldn't reach the lamp\n  To get a puff of black smoke from the flame,\n  Or blow a rumple in the collie's coat.\n  You make a little foursquare block of air,\n  Quiet and light and warm, in spite of all\n  The illimitable dark and cold and storm,\n  And by so doing give these three, lamp, dog,\n  And book-leaf, that keep near you, their repose;\n  Though for all anyone can tell, repose\n  May be the thing you haven't, yet you give it.\n  So false it is that what we haven't we can't give;\n  So false, that what we always say is true.\n  I'll have to turn the leaf if no one else will.\n  It won't lie down. Then let it stand. Who cares?\"\n\n  \"I shouldn't want to hurry you, Meserve,\n  But if you're going--Say you'll stay, you know?\n  But let me raise this curtain on a scene,\n  And show you how it's piling up against you.\n  You see the snow-white through the white of frost?\n  Ask Helen how far up the sash it's climbed\n  Since last we read the gage.\"\n\n                                               \"It looks as if\n  Some pallid thing had squashed its features flat\n  And its eyes shut with overeagerness\n  To see what people found so interesting\n  In one another, and had gone to sleep\n  Of its own stupid lack of understanding,\n  Or broken its white neck of mushroom stuff\n  Short off, and died against the window-pane.\"\n\n  \"Brother Meserve, take care, you'll scare yourself\n  More than you will us with such nightmare talk.\n  It's you it matters to, because it's you\n  Who have to go out into it alone.\"\n\n  \"Let him talk, Helen, and perhaps he'll stay.\"\n\n  \"Before you drop the curtain--I'm reminded:\n  You recollect the boy who came out here\n  To breathe the air one winter--had a room\n  Down at the Averys'? Well, one sunny morning\n  After a downy storm, he passed our place\n  And found me banking up the house with snow.\n  And I was burrowing in deep for warmth,\n  Piling it well above the window-sills.\n  The snow against the window caught his eye.\n  'Hey, that's a pretty thought'--those were his words.\n  'So you can think it's six feet deep outside,\n  While you sit warm and read up balanced rations.\n  You can't get too much winter in the winter.'\n  Those were his words. And he went home and all\n  But banked the daylight out of Avery's windows.\n  Now you and I would go to no such length.\n  At the same time you can't deny it makes\n  It not a mite worse, sitting here, we three,\n  Playing our fancy, to have the snowline run\n  So high across the pane outside. There where\n  There is a sort of tunnel in the frost\n  More like a tunnel than a hole--way down\n  At the far end of it you see a stir\n  And quiver like the frayed edge of the drift\n  Blown in the wind. I _like_ that--I like _that_.\n  Well, now I leave you, people.\"\n\n                                               \"Come, Meserve,\n  We thought you were deciding not to go--\n  The ways you found to say the praise of comfort\n  And being where you are. You want to stay.\"\n\n  \"I'll own it's cold for such a fall of snow.\n  This house is frozen brittle, all except\n  This room you sit in. If you think the wind\n  Sounds further off, it's not because it's dying;\n  You're further under in the snow--that's all--\n  And feel it less. Hear the soft bombs of dust\n  It bursts against us at the chimney mouth,\n  And at the eaves. I like it from inside\n  More than I shall out in it. But the horses\n  Are rested and it's time to say good-night,\n  And let you get to bed again. Good-night,\n  Sorry I had to break in on your sleep.\"\n\n  \"Lucky for you you did. Lucky for you\n  You had us for a half-way station\n  To stop at. If you were the kind of man\n  Paid heed to women, you'd take my advice\n  And for your family's sake stay where you are.\n  But what good is my saying it over and over?\n  You've done more than you had a right to think\n  You could do--_now_. You know the risk you take\n  In going on.\"\n\n                                    \"Our snow-storms as a rule\n  Aren't looked on as man-killers, and although\n  I'd rather be the beast that sleeps the sleep\n  Under it all, his door sealed up and lost,\n  Than the man fighting it to keep above it,\n  Yet think of the small birds at roost and not\n  In nests. Shall I be counted less than they are?\n  Their bulk in water would be frozen rock\n  In no time out to-night. And yet to-morrow\n  They will come budding boughs from tree to tree\n  Flirting their wings and saying Chickadee,\n  As if not knowing what you meant by the word storm.\"\n\n  \"But why when no one wants you to go on?\n  Your wife--she doesn't want you to. We don't,\n  And you yourself don't want to. Who else is there?\"\n\n  \"Save us from being cornered by a woman.\n  Well, there's\"--She told Fred afterward that in\n  The pause right there, she thought the dreaded word\n  Was coming, \"God.\" But no, he only said\n  \"Well, there's--the storm. That says I must go on.\n  That wants me as a war might if it came.\n  Ask any man.\"\n\n                                He threw her that as something\n  To last her till he got outside the door.\n  He had Cole with him to the barn to see him off.\n  When Cole returned he found his wife still standing\n  Beside the table near the open book,\n  Not reading it.\n\n                                     \"Well, what kind of a man\n  Do you call that?\" she said.\n\n                                              \"He had the gift\n  Of words, or is it tongues, I ought to say?\"\n\n  \"Was ever such a man for seeing likeness?\"\n\n  \"Or disregarding people's civil questions--\n  What? We've found out in one hour more about him\n  Than we had seeing him pass by in the road\n  A thousand times. If that's the way he preaches!\n  You didn't think you'd keep him after all.\n  Oh, I'm not blaming you. He didn't leave you\n  Much say in the matter, and I'm just as glad\n  We're not in for a night of him. No sleep\n  If he had stayed. The least thing set him going.\n  It's quiet as an empty church without him.\"\n\n  \"But how much better off are we as it is?\n  We'll have to sit here till we know he's safe.\"\n\n  \"Yes, I suppose you'll want to, but I shouldn't.\n  He knows what he can do, or he wouldn't try.\n  Get into bed I say, and get some rest.\n  He won't come back, and if he telephones,\n  It won't be for an hour or two.\"\n\n                                                   \"Well then.\n  We can't be any help by sitting here\n  And living his fight through with him, I suppose.\"\n\n       *       *       *       *       *\n\n  Cole had been telephoning in the dark.\n  Mrs. Cole's voice came from an inner room:\n  \"Did she call you or you call her?\"\n\n                                                \"She me.\n  You'd better dress: you won't go back to bed.\n  We must have been asleep: it's three and after.\"\n\n  \"Had she been ringing long? I'll get my wrapper.\n  I want to speak to her.\"\n\n                                      \"All she said was,\n  He hadn't come and had he really started.\"\n\n  \"She knew he had, poor thing, two hours ago.\"\n\n  \"He had the shovel. He'll have made a fight.\"\n\n  \"Why did I ever let him leave this house!\"\n\n  \"Don't begin that. You did the best you could\n  To keep him--though perhaps you didn't quite\n  Conceal a wish to see him show the spunk\n  To disobey you. Much his wife'll thank you.\"\n\n  \"Fred, after all I said! You shan't make out\n  That it was any way but what it was.\n  Did she let on by any word she said\n  She didn't thank me?\"\n\n                                \"When I told her 'Gone,'\n  'Well then,' she said, and 'Well then'--like a threat.\n  And then her voice came scraping slow: 'Oh, you,\n  Why did you let him go'?\"\n\n                                  \"Asked why we let him?\n  You let me there. I'll ask her why she let him.\n  She didn't dare to speak when he was here.\n  Their number's--twenty-one? The thing won't work.\n  Someone's receiver's down. The handle stumbles.\n  The stubborn thing, the way it jars your arm!\n  It's theirs. She's dropped it from her hand and gone.\"\n\n  \"Try speaking. Say 'Hello'!\"\n\n                                         \"Hello. Hello.\"\n\n  \"What do you hear?\"\n\n                                 \"I hear an empty room--\n  You know--it sounds that way. And yes, I hear--\n  I think I hear a clock--and windows rattling.\n  No step though. If she's there she's sitting down.\"\n\n  \"Shout, she may hear you.\"\n\n                                  \"Shouting is no good.\"\n\n  \"Keep speaking then.\"\n\n                                   \"Hello. Hello. Hello.\n  You don't suppose--? She wouldn't go out doors?\"\n\n  \"I'm half afraid that's just what she might do.\"\n\n  \"And leave the children?\"\n\n                                   \"Wait and call again.\n  You can't hear whether she has left the door\n  Wide open and the wind's blown out the lamp\n  And the fire's died and the room's dark and cold?\"\n\n  \"One of two things, either she's gone to bed\n  Or gone out doors.\"\n\n                           \"In which case both are lost.\n  Do you know what she's like? Have you ever met her?\n  It's strange she doesn't want to speak to us.\"\n\n        \"Fred, see if you can hear what I hear. Come.\"\n\n  \"A clock maybe.\"\n\n                        \"Don't you hear something else?\"\n\n  \"Not talking.\"\n\n                          \"No.\"\n\n                         \"Why, yes, I hear--what is it?\"\n\n  \"What do you say it is?\"\n\n                    \"A baby's crying!\n  Frantic it sounds, though muffled and far off.\"\n\n  \"Its mother wouldn't let it cry like that,\n  Not if she's there.\"\n\n                               \"What do you make of it?\"\n\n  \"There's only one thing possible to make,\n  That is, assuming--that she has gone out.\n  Of course she hasn't though.\" They both sat down\n  Helpless. \"There's nothing we can do till morning.\"\n\n  \"Fred, I shan't let you think of going out.\"\n\n  \"Hold on.\" The double bell began to chirp.\n  They started up. Fred took the telephone.\n  \"Hello, Meserve. You're there, then!--And your wife?\n  Good! Why I asked--she didn't seem to answer.\n  He says she went to let him in the barn.--\n  We're glad. Oh, say no more about it, man.\n  Drop in and see us when you're passing.\"\n\n                                                  \"Well,\n  She has him then, though what she wants him for\n  I _don't_ see.\"\n\n                              \"Possibly not for herself.\n  Maybe she only wants him for the children.\"\n\n  \"The whole to-do seems to have been for nothing.\n  What spoiled our night was to him just his fun.\n  What did he come in for?--To talk and visit?\n  Thought he'd just call to tell us it was snowing.\n  If he thinks he is going to make our house\n  A halfway coffee house 'twixt town and nowhere----\"\n\n  \"I thought you'd feel you'd been too much concerned.\"\n\n  \"You think you haven't been concerned yourself.\"\n\n  \"If you mean he was inconsiderate\n  To rout us out to think for him at midnight\n  And then take our advice no more than nothing,\n  Why, I agree with you. But let's forgive him.\n  We've had a share in one night of his life.\n  What'll you bet he ever calls again?\"\n\n\n\n\n_THE SOUND OF THE TREES_\n\n\n  _I wonder about the trees.\n  Why do we wish to bear\n  Forever the noise of these\n  More than another noise\n  So close to our dwelling place?\n  We suffer them by the day\n  Till we lose all measure of pace,\n  And fixity in our joys,\n  And acquire a listening air.\n  They are that that talks of going\n  But never gets away;\n  And that talks no less for knowing,\n  As it grows wiser and older,\n  That now it means to stay.\n  My feet tug at the floor\n  And my head sways to my shoulder\n  Sometimes when I watch trees sway,\n  From the window or the door.\n  I shall set forth for somewhere,\n  I shall make the reckless choice\n  Some day when they are in voice\n  And tossing so as to scare\n  The white clouds over them on.\n  I shall have less to say,\n  But I shall be gone._\n\n       *       *       *       *       *\n\n\n\n\nSOME RECENT POETRY\n\n  Stephen Vincent Benet's\n      Heavens and Earth\n\n  Thomas Burke's\n      The Song Book of Quong Lee of Limehouse\n\n  Richard Burton's\n      Poems of Earth's Meaning\n\n  Francis Carlin's\n      My Ireland\n      The Cairn of Stars\n\n  Padraic Colum's\n      Wild Earth and Other Poems\n\n  Grace Hazard Conkling's\n      Wilderness Songs\n\n  Walter De La Mare's\n      The Listeners and Other Poems\n      Peacock Pie. Ill'd by W. H. Robinson\n      Motley and Other Poems\n      Collected Poems 1901-1918. 2 Vols.\n\n  Robert Frost's\n      North of Boston\n      Mountain Interval. New Edition, with Portrait\n      A Boy's Will\n\n  Carl Sandburg's\n      Cornhuskers\n      Chicago Poems\n\n  Lew Sarrett's\n      Many Many Moons\n\n  Louis Untermeyer's\n      These Times\n      ---- and Other Poets\n      Poems of Heinrich Heine (Translated)\n      The New Era in American Poetry\n\n  Margaret Widdemer's\n      The Old Road to Paradise\n      Factories and Other Poems\n\n       *       *       *       *       *\n\nTHE HOME BOOK OF VERSE\n\n  American and English 1580-1918\n  Selected and arranged by Burton Egbert Stevenson\n  Third Edition Revised and Enlarged\n\nOver 4,000 pages of the best verse in English, ranging all the way\nfrom the classics to some of the best newspaper verse of to-day. In\nseveral different editions.\n\n       *       *       *       *       *\n\n  HENRY HOLT AND COMPANY\n  PUBLISHERS\n  NEW YORK\n\n       *       *       *       *       *\n\n\n\n\nTranscriber Notes\n\nTypographical inconsistencies have been changed and are listed below.\n\nArchaic and variable spelling and hyphenation is preserved.\n\nAuthor's punctuation style is preserved, except where noted.\n\nPassages in italics indicated by _underscores_.\n\nPassages in bold indicated by =equal signs=.\n\n\nTranscriber Changes\n\nThe following changes were made to the original text:\n\n  Page 46: Added period after =trees= (Tomatoes, beets,\n           beans, pumpkins, corn, And even fruit =trees.=)\n\n  Page 63: Added stanza break between go and Don't (And\n           three miles more to =go!\" \"Don't= let him go.)\n\n  Page 63: Single quote changed to double after =through=\n           (\"He'll pull =through.\"=)\n\n  Page 72: Removed extra stanza break after =stumbles=\n           (The handle =stumbles. The= stubborn thing, the way it\n           jars your arm!)\n\n  Page 74: Removed extra stanza break after =wife=\n           (\"Hello, Meserve. You're there, then!--And your =wife?\n           Good!= Why I asked--she didn't seem to answer.)\n\n\n\n\n\n","id":"29345"}]