[
  {
    "Title": [
      "He fought to a finish - You lend to the finish",
      "[graphic] :",
      "Victory Liberty Loan."
    ],
    "Materials": [
      "1 print (poster) :"
    ]
  },
  {
    "Title": [
      "Bobby Jones at the finish of the swing - wood club",
      "[graphic]."
    ],
    "Year": [
      "c1930 March."
    ],
    "Materials": [
      "1 photographic print on stereo card :"
    ]
  },
  {
    "Title": [
      "Bobby Jones at the finish of the swing - mashie pitch",
      "[graphic]."
    ],
    "Year": [
      "c1930 March."
    ],
    "Materials": [
      "1 photographic print on stereo card :"
    ]
  },
  {
    "Title": [
      "Awaiting the finish at the Sixth All Alaska Sweepstakes",
      "[graphic]."
    ]
  },
  {
    "Title": [
      "How the White Steamer crossed the finish, Mt. Giant De...r climb, May 30, 1907",
      "[graphic]."
    ]
  },
  {
    "Title": [
      "[Wilma Rudolph at the finish line during 50 yard dash at track meet in Madison Square Garden]",
      "[graphic]."
    ]
  },
  {
    "Title": [
      "Olympic games at Amsterdam, Holland. The finish of the 100 meter dash finals, won by Percy Williams",
      "[graphic]."
    ]
  },
  {
    "Title": [
      "[Roger Bannister crossing the finish line in three minutes and 59.4 seconds, achieving the four-minute mile, Oxford, England]",
      "[graphic]."
    ]
  },
  {
    "Title": [
      "Workmen placing the finishing touches on the reviewing stand in the Court of Honor from which Mr. Hoover will review the inaugural parade",
      "[graphic]."
    ]
  },
  {
    "Title": [
      "Employees of the Ford Motor Company in Detroit putting the finishing touches on the new super deluxe cars as they near the end of the assembly line, on August 21st",
      "[graphic]."
    ]
  },
  {
    "Title": [
      "[Bishop James E. Freeman watching a stone cutter of the George A. Fuller Co. put the finishing touches on a section of the base for the National Cathedral on Mount Saint Alban]",
      "[graphic]."
    ]
  }
]